{"advent-of-code/2024/2024-Advent-of-Code":{"slug":"advent-of-code/2024/2024-Advent-of-Code","filePath":"advent of code/2024/2024 Advent of Code.md","title":"2024 Advent of Code","links":[],"tags":["python","bash"],"content":"2024 Advent of Code\nSee the code: github.com/thehandsomezebra/GARDEN_tech-scratchpad\nLemme tell ya. I really do love programming puzzles but when it comes to things that are “lets walk on this map.. and turn..” and it’s like a video game? nah. just. nah. I’ve got better things to do with my life.. And that’s ok. I don’t mind that it’s unfinished. If it doesn’t spark joy, then that’s fine. I love business logic - not this stuff.\nI got a handful done.\nI had a personal goal to at least do the first part for 20 days in Bash, Python and Go… but… uh.. you can see that did not happen. There’s always next year.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\ndaybashpythonday 1[✔️][✔️][✔️][✔️]day 2[✔️][✔️][✔️][✔️]day 3[✔️][✔️][✔️][✔️]day 4[✔️][✔️][✔️][✔️]day 5[✔️][✔️][ ][ ]\n\nPython stuff:\nday 1\n \ncd python\n \n#day 1\npython day1.py\n \n#day 1 unit tests\npython -m unittest tests/test_day1a.py\npython -m unittest tests/test_day1b.py\n \nAll tests\ncd python\npython -m unittest discover -s tests -p &#039;test*.py&#039;\ncontainerize it\n#run from root\nmake run-python DAY=day1"},"conferences/2020/2020-Codemash":{"slug":"conferences/2020/2020-Codemash","filePath":"conferences/2020/2020 Codemash.md","title":"2020 CodeMash Recap: A Newb's Highlight Reel","links":[],"tags":[],"content":"It was my first time ever experiencing CodeMash: and I’d have to say: I thoroughly enjoyed every moment. I want to take this chance to present a highlight reel, as seen from a newb’s perspective.\nCodeMash Newb\nThe ribbon labeled “Newb” provided an easy-opener to any conversation: “So, this is your first codemash?” The venue was amazing: the sessions, the hotel, the food, and more. I am so grateful that I got to kick off my year with some awesome training sessions: when in tech, the learning never stops.\nMade it to #codemash!! pic.twitter.com/R9F6Q6lbI7— Stephanie (@handsomezebra) January 7, 2020 \nDay 1: Precompiler Sessions\nHacking Your Emotional API: Emotional Intelligence in Practice\n.. with John Sawers @johnksawers and Aaron Aldrich @crayzeigh was how I started my first day at CodeMash. This was a great soft-skills session that took a 4 hour dive into EQ (Emotional Intelligence), how to express feelings, and non-violent communication often in relation to the workplace. Practicing skills in a group was really effective, from my point of view. Despite the large crowd, I found it very effective to have open conversations and examples of the stages with observations, feelings, needs and requests. The speakers were compassionate and made the first session of my first CodeMash very memorable.\nemotionalapi.com/\nGet Up And Running Quickly with Vue.js\n… led by Burton Smith @stuffbreaker was hands-on technical learning at a relatively fast pace: and I loved it. Prior to this session, I hadn’t done more than just poke it with a stick to see what it could do. Vue.js is a middle ground between Angular and React in regards to the learning curve. Angular can offer a strong typescript based javascript framework backed by Google. React is a few years newer than Angular, developed by Facebook, and is lightweight, non-browser specific and uses a virutal DOM. Vue is even newer still, and it’s framework seems to adapt many of the beloved attributes from both React and Angular. Vue is lightweight, offers better performance than Angular, and it’s flexible like React. Vue.js is quite beloved by those who use it: so I decided to give this class a try!\nThat&#039;s what she said... #100daysofcode #VueJS #codemash pic.twitter.com/MYNeLs6ACp— Stephanie (@handsomezebra) January 7, 2020 \nDay 2: Round Two of the Precompiler Sessions\nBuilding Quality JavaScript with Test-Driven Development\n… with Steven Hicks @pepopowitz. I have written code.. I have written tests.. But I’ve never done test-driven development. I loved how this session was very intuitive and it encouraged us to think in terms of “we need the program to test positive for X, Y, Z — so we’ll code for X, Y, Z”. Learning TDD with Jest from Steven was spectacular — It’s a session I’m happy I attended as I’m already using this technique in my studies!\nAwesome session on #TDD test driven design given by @pepopowitz at #codemash ! pic.twitter.com/y50XtEaEZq— Stephanie (@handsomezebra) January 8, 2020 \nHelp Cure the #1 Leading Cause of Death in America\n… or A Civic Developer’s Quest to Change Healthcare (changed name of session just beforehand) with Luther Hill (www.linkedin.com/in/sweetdatatea/) was the next session that I chose. Luther presented how to build a learning machine in an easily digestible format. I walked into this session thinking that training AI with datasets was something that was complicated, challenging and required a big brain to figure out… I was honestly expecting this to be a show-and-tell, high-level experience, but I was pleasantly surprised! Luther taught the class everything they needed to know, end to end, how to get into machine learning and build our own models. He touched on using kaggle for datasets, python for running the code, using jupyter notebooks, and running it all in google colabs with google drive as a server. Without a doubt, this was my favorite session of 2020.\nReady for an awesome session by Luther Hill on a Civic developer&#039;s quest to change healthcare!! #codemash pic.twitter.com/s9hjyUXC6B— Stephanie (@handsomezebra) January 8, 2020 \nI wrapped up the evening with some lightning talks!\nlightningvote.com/events/26\nMy favorites were…\n\nEstimatesAreBS by @scottconnerly - talking about how estimating sprints with points just ain’t the best… slides.com/scottconnerly/estimatesarebs\nMental health github.com/aetherical/end-the-stigma\nSteve Crow - Balloon Twisting: The Esoteric Language You Compile Yourself: programming languages &amp; balloon animals @cr0wst\nMichael Richardson - Stop Saying “I’m bad with names”\n\nLightning talks... This is an awesome way to wrap up the evening! #codemash pic.twitter.com/xoRfxlHwoF— Stephanie (@handsomezebra) January 9, 2020 \nDay 3: The Real Convention Begins\nCompared to the pre-compiler with two sessions per day, the next two days went blazing fast. Hallways were lined with sponsors, classrooms were full up and conversations were always bubbling.\nCapture The Flag: How CTF Competitions make you a better developer\nWatch the recording here: www.pluralsight.com/courses/codemash-session-38\n… with John Joerner @johnkoerner\nWith my hubby in IT security and my interests with development, I can’t wait until we take on our first CTF. As John went over in his session, I recognized the value of finding ways to attack; but also taking notes on ways to defend while developing.\nWhy CTF can make you a better developer talk by @johnkoerner , starting now at #codemash ! pic.twitter.com/IadisaxgV9— Stephanie (@handsomezebra) January 9, 2020 \nPostman Delivers! A deep dive into API Testing\n… with Bob Crowley @contrivedex\nWatch the recording here: www.pluralsight.com/courses/codemash-session-05\nAt my day job, there are only a handful of people on my team that use postman… What about me? You guessed it, I’m one of them. Products that are live to customers, but the internal process isn’t 100% developed requires some manual API pushes. I really enjoyed this session and learned a couple features that I hadn’t used before.\nReady for Postman API testing deep dive by @contrivedex at #codemash! pic.twitter.com/lCZkXm2ox1— Stephanie (@handsomezebra) January 9, 2020 \nJavascript: the grumpy parts\n… with Rob Rich @rob_rich\nWatch the recording here: www.pluralsight.com/courses/codemash-session-80\nI am SO fond of javascript… and this session really affirmed my love of it (especially while hearing all of the groans throughout the room). We ran through some lines of code as the compiler, but adjusted on order of lines or usage of var/let/const: the vast differences of expected vs reality shines a light on the grumpy parts of javascript.\nFun fact: Javascript was created in 10 days.\n&quot;What&#039;s the difference between Java and JavaScript? Well, it&#039;s like the difference between Car and Carpet.&quot; @rob_rich #codemash— Stephanie (@handsomezebra) January 9, 2020 \nApp Deco: Applied Design Thinking for Secure Development\n… with Wolf Goerlich @jwgoerlich\nWolf walked us through a few recent experiences as an advisory CISO in regards to app design. The biggest takeaway for me was, as I tweeted, “Constraints cause creative people…creative people cause security problems.” I feel this sentence in the core of my being… being both that creative person AND the person who needs to defend against other creative people: this talk really hit home for me. Locking down processes or security and NOT causing those creative people to come out of the woodwork is a challenge that developers need to consider.\n&quot;Constraints cause creative people... Creative people cause security problems.&quot; @jwgoerlich &#039;s talk about app design and security at #codemash was excellent. pic.twitter.com/kKmwD7UWp0— Stephanie (@handsomezebra) January 9, 2020 \nThe remaining of the evening was filled with events like casino and carnival games, dessert bar, karaoke, jam sessions and a full waterpark party… and for me: an evening of introverted quiet-time in my hotel room with some pizza and ice cream.\nDay 4: The Last Day\nThe best code is code never written\nWatch the recording here: www.pluralsight.com/courses/codemash-session-95\n… with Daniel Davis @daniel_davis\nWhen I first started programming, I can remember bragging to my family “I wrote 1,200 lines of code today!!” — I look at that statement today and I cringe!\nDaniel provided an awesome perspective with “You aren’t gunna need it”, “Not invented here” (beg, borrow, steal, cheat to win), “Keep it stupid simple”, “Fake it till you make it” and more. Putting all of these ideas and techniques together in one session was fantastic.\nReally excited for this talk.. the best code is code never written with @daniel_davis at #codemash pic.twitter.com/E97B9KwT40— Stephanie (@handsomezebra) January 10, 2020 \nBurn it down and start again: principles of modern javascript\nWatch the recording here: www.pluralsight.com/courses/codemash-session-33\n…with Joe Morgan (author of Simplifying Javascript)@Joesmorgan\nPairing this session with the “grumpy parts” session yesterday was excellent. Joe went in depth with some of the modern principles, ways to make your code predictable, readable, simple and flexible.\nBottom line, though? The best code is the best code for your team.\nBurning things down? JavaScript? You&#039;ve got my interest for sure ... @joesmorgan at #codemash pic.twitter.com/d9wtaNQfEW— Stephanie (@handsomezebra) January 10, 2020 \nI&#039;m loving this already... Starting with JavaScript and Picasso, side by side. As an art student AND a developer, this makes my soul sing. @joesmorgan at #codemash pic.twitter.com/gqCRtMbpTo— Stephanie (@handsomezebra) January 10, 2020 \nExplain it to me like I’m 5: Oauth2 and OpenID\nWatch the recording here: www.pluralsight.com/courses/codemash-session-46\n… with Daniel Mikusa @dmikusa\nOne of the things on my “want to learn it” list is getting an OpenID SSO integrated in one of my personal projects. I’m not a security pro - so I wanted to start at base level to get some knowledge: Daniel was awesome with his session, comparing each step of security with a literal world of a 5 year old! Things like remembering my jacket, going to my locker, and even getting lunch from the lunch lady were all compared to authorization codes, grant types and scopes!\nNext up is going to be excellent.. I love that it&#039;s not &quot;crash course&quot;, but instead &quot;explain it to me kind I&#039;m five&quot; for Oauth 2@dmikusa at #codemash pic.twitter.com/zaPbhS6XkZ— Stephanie (@handsomezebra) January 10, 2020 \nCalculating insulin with automated carb counting using AI, ML and web bluetooth\n… by Todd Sharp @recursivecodes\nTodd’s session was excellent: design by necessity! When faced with a challenge like diabetes, and recognizing that it can be maintained via numbers &amp; lifestyle awareness: tackle it with tech. I’ve said this before to my peers many times: we’re clever, we’re smart, and if we started to tackle issues with tech, I bet we could change the world. Todd is doing just that: and he’s starting right at home.\nThis season by @recursivecodes about diabetes and tech really hit home for me... I&#039;ve got many fam and friends that have diabetes... This is going to be an awesome session at #codemash pic.twitter.com/sSMOnkibVp— Stephanie (@handsomezebra) January 10, 2020 \nRecognize programmer burnout: how to recognize and avoid it\nWatch the recording here: www.pluralsight.com/courses/codemash-session-86\n… with @_s_hari\nI feel like the meme “oh ha ha, I do that” could have been posted on the door as we all walked in. Something that stuck with me is a story that Santosh shared: He created an app that sent an alert via Slack whenever a bug came in… and that chime haunts him to this day. That resonated with me so much..\nSome tips for reducing burnout?\n\nUnderstand your role\nReduce multitasking\nLearn to say NO\nReduce social media usage and notifications\nGet a life outside of work\nGet exercise and sleep\n\nFull room for an awesome talk by @_s_hari #codemash ... The reality of burnout! This one really hits home for me... (And with people lined up along the wall, I know I&#039;m not alone) pic.twitter.com/aurJo8Z2s2— Stephanie (@handsomezebra) January 10, 2020 \nI’m so excited that I was able to experience CodeMash 2020: I brought home a lot of knowledge (and a lot of swag) and I can’t wait until next year!\nParting is such sweet sorrow! See you next year, #codemash !! pic.twitter.com/YHOKAraSNf— Stephanie (@handsomezebra) January 10, 2020 \nCheck out all of the other sessions that were recorded here:\nwww.pluralsight.com/authors/codemash-conference"},"conferences/2022/2022-GrrCon":{"slug":"conferences/2022/2022-GrrCon","filePath":"conferences/2022/2022 GrrCon.md","title":"2022 GrrCon","links":[],"tags":[],"content":"Oct 13-14 2022\nYet again… bad at taking notes.\nIt was my first GrrCon, I attended a lot of good sessions.. met up with some colleagues and got far too much swag from the vendor hall.\nAnyways… here’s some pics.. lol best I can do\n\n\n\n\n\n"},"conferences/2023/2023-Black-Hat-and-DefCon":{"slug":"conferences/2023/2023-Black-Hat-and-DefCon","filePath":"conferences/2023/2023 Black Hat and DefCon.md","title":"2023 Black Hat and DefCon","links":[],"tags":[],"content":"August 8-15 2023\nI was REEALLY bad at taking notes this year.. It was my first year, and I hit a lot of talks but mostly did a LOT of exploring and hands-on stuff.\nThis was a good talk that I was glad I saw it in person\nwww.youtube.com/watch\nIt was also the year that we had the bomb threat. so that was an experience. I got a challenge coin from someone just standing out there with us.\nAnyhow, I took a few photos with my flip phone. Here they are.\n\n\n\nOh and I also ended up getting an NFC tag in my hand.. lol.\nNExT RFID + NFC Chip\nNTAG216 13.56MHz ISO14443A NFC chip\nT5577 125kHz RFID chip (preprogrammed EM41xx 40 bit ID)\n2.1x15mm cylindrical sterile bioglass implant\ndangerousthings.com/product/next/\n\nFor the first time at DefCon?  Yeah, I’ll miss my breakfast burrito, but next year will be good too. Fun times."},"conferences/2023/2023-Grrcon":{"slug":"conferences/2023/2023-Grrcon","filePath":"conferences/2023/2023 Grrcon.md","title":"2023 Grrcon","links":[],"tags":[],"content":"September 28-29, 2023\nAnother good GrrCon — another one I didn’t take notes, lol\nanyhow.. I got some pics of slides n stuff.\nI also got a tattoo at this hacker con. so that was fun.\nbirds aren&#039;t real\nSo here’s the pics of slides n stuff\n\n\nAnd I know that these sessions basically don’t get recorded.. but there’s one that I wish was. Richard Haight, fmr. Bell Labs did a keynote. spectacular.\nHere’s his talk\nrch-ideas.com/UNIXnotes.pdf\nHe got a standing ovation, top tier talk.\n"},"conferences/2024/2024-BSides-and-DefCon/2024-BSides-Vegas-and-DefCon":{"slug":"conferences/2024/2024-BSides-and-DefCon/2024-BSides-Vegas-and-DefCon","filePath":"conferences/2024/2024 BSides and DefCon/2024 BSides Vegas and DefCon.md","title":"2024 BSides Vegas and DefCon","links":["conferences/2024/2024-BSides-and-DefCon/Redis-or-Not-Argo-CD--and--GitOps-from-an-Attacker’s-Perspective-CVE-2024-31989-1030a","conferences/2024/2024-BSides-and-DefCon/How-We-Accidentally-Became-Hardware-Hackers-Tuesday-202-PM","conferences/2024/2024-BSides-and-DefCon/Zero-downtime-credential-rotation-Tuesday-2-56-PM","conferences/2024/2024-BSides-and-DefCon/Tactics-of-a-Trash-Panda-Tuesday-5-PM","conferences/2024/2024-BSides-and-DefCon/Organizers-Meetup-7pm","conferences/2024/2024-BSides-and-DefCon/Keynote,-Day-2-Homicideware-930a","conferences/2024/2024-BSides-and-DefCon/Skytalks---Session-7-1030a","conferences/2024/2024-BSides-and-DefCon/Pipeline-Pandemonium--How-to-Hijack-the-Cloud-and-Make-it-Rain-Insecurity-1030a","conferences/2024/2024-BSides-and-DefCon/Skytalks---Session-8-1130a","conferences/2024/2024-BSides-and-DefCon/Hacking-and-tracking-your-career-Wednesday-1-28-PM","conferences/2024/2024-BSides-and-DefCon/The-road-to-Developer's-hearts-Wednesday-1-56-PM","conferences/2024/2024-BSides-and-DefCon/Discover-the-hidden-vulnerability-interlligence-within-CISA's-KEV-catalog-Wednesday-2-30-PM","conferences/2024/2024-BSides-and-DefCon/Nothing-went-to-plan-because-you-didn't-have-a-plan-Wednesday-259-PM","conferences/2024/2024-BSides-and-DefCon/Skytalks---Session-11-500p","conferences/2024/2024-BSides-and-DefCon/Gone-in-60-Seconds…-How-Azure-AD-Entra-ID-Tenants-are-Compromised","conferences/2024/2024-BSides-and-DefCon/Catch-them-all!-Detection-Engineering-and-Purple-Teaming-in-the-Cloud","conferences/2024/2024-BSides-and-DefCon/Breaching-AWS-accounts-through-shadow-resources-Friday-227-PM","conferences/2024/2024-BSides-and-DefCon/Social-Engineering-like-you're-Picard-Friday-3-26-PM","conferences/2024/2024-BSides-and-DefCon/Exploit-k8s-via-misconfiguration-.yaml-in-CSP-environments-Friday-125pm","conferences/2024/2024-BSides-and-DefCon/Disenshittify-or-die!-How-hackers-can-seize-the-means-of-computation---Cory-Doctorow-Saturday-11-58-AM","conferences/2024/2024-BSides-and-DefCon/Kicking-in-the-Door-to-the-Cloud-Exploiting-Cloud-Provider-Vulnerabilities-for-Initial-Access-Sunday-10-52-AM","conferences/2024/2024-BSides-and-DefCon/Unexpected-Leaks-in-AWS-Transit-Gateways-Sunday-12-35-PM","conferences/2024/2024-BSides-and-DefCon/Kubernetes-Attack-Simulation-The-Definitive-Guide"],"tags":[],"content":"Monday Aug 5, 2024\nFlight into Vegas\nTuesday Aug 6, 2024\nDay 1 BSides\n\nRedis or Not Argo CD &amp; GitOps from an Attacker’s Perspective CVE-2024-31989 1030a\nHow We Accidentally Became Hardware Hackers Tuesday 202 PM\nZero downtime credential rotation Tuesday 2-56 PM\nTactics of a Trash Panda Tuesday 5 PM\nOrganizers Meetup 7pm\n\nWednesday Aug 7, 2024\nDay 2 BSides\n\nKeynote, Day 2 Homicideware 930a\nSkytalks - Session 7 1030a\nPipeline Pandemonium- How to Hijack the Cloud and Make it Rain Insecurity 1030a\nSkytalks - Session 8 1130a\nHacking and tracking your career Wednesday 1-28 PM\nThe road to Developer’s hearts Wednesday 1-56 PM\nDiscover the hidden vulnerability interlligence within CISA’s KEV catalog Wednesday 2-30 PM\nNothing went to plan because you didn’t have a plan Wednesday 259 PM\nSkytalks - Session 11 500p\n\nThursday Aug 8, 2024\nDay 0 DefCon — Line Con\nNo sessions attended on this day.\nWoke up early and got in line… spent most of the entire day in line.\nFriday Aug 9, 2024\nDay 1 DefCon\n\nGone in 60 Seconds… How Azure AD Entra ID Tenants are Compromised\nCatch them all! Detection Engineering and Purple Teaming in the Cloud\nBreaching AWS accounts through shadow resources Friday 227 PM\nSocial Engineering like you’re Picard Friday 3-26 PM\nExploit k8s via misconfiguration .yaml in CSP environments Friday 125pm\n\nSaturday Aug 10, 2024\nDay 2 DefCon\n\nDisenshittify or die! How hackers can seize the means of computation - Cory Doctorow Saturday 11-58 AM\n\nOn this day, I did a lot more exploring in the villages and got hands on with stuff.\nDid a few challenges along the way, too.\n\nlol, got my badge signed…lol fun times…\n\nSunday Aug 11, 2024\nDay 3 DefCon\n\nKicking in the Door to the Cloud Exploiting Cloud Provider Vulnerabilities for Initial Access Sunday 10-52 AM\nUnexpected Leaks in AWS Transit Gateways Sunday 12-35 PM\nKubernetes Attack Simulation The Definitive Guide\nClosing ceremonies\n\nMonday Aug 12, 2024\n\nFlight home\n"},"conferences/2024/2024-BSides-and-DefCon/Breaching-AWS-accounts-through-shadow-resources-Friday-227-PM":{"slug":"conferences/2024/2024-BSides-and-DefCon/Breaching-AWS-accounts-through-shadow-resources-Friday-227-PM","filePath":"conferences/2024/2024 BSides and DefCon/Breaching AWS accounts through shadow resources Friday 227 PM.md","title":"Breaching AWS accounts through shadow resources Friday 227 PM","links":["conferences/2024/2024-BSides-and-DefCon/2024-BSides-Vegas-and-DefCon"],"tags":[],"content":"… Back to 2024 BSides Vegas and DefCon …\nwww.youtube.com/watch\nThis talk on “Shadow Resources” was an interesting look into how AWS services can create predictable S3 buckets behind the scenes, which can then be taken over by an attacker. The core of the attack is that if someone knows your AWS Account ID, they can pre-create these buckets and hijack services like CloudFormation or Glue… leading to a full remote account takeover. The “Bucket Monopoly” technique they introduced, where an attacker claims all predictable bucket names across all regions for a target, was a particularly clever and scary escalation of the attack. This whole talk really make me (and prolly lots of others too) rethink the “common” wisdom that an AWS account ID isn’t a secret."},"conferences/2024/2024-BSides-and-DefCon/Catch-them-all!-Detection-Engineering-and-Purple-Teaming-in-the-Cloud":{"slug":"conferences/2024/2024-BSides-and-DefCon/Catch-them-all!-Detection-Engineering-and-Purple-Teaming-in-the-Cloud","filePath":"conferences/2024/2024 BSides and DefCon/Catch them all! Detection Engineering and Purple Teaming in the Cloud.md","title":"Catch them all! Detection Engineering and Purple Teaming in the Cloud","links":["conferences/2024/2024-BSides-and-DefCon/2024-BSides-Vegas-and-DefCon"],"tags":[],"content":"… Back to 2024 BSides Vegas and DefCon …\nwww.slideshare.net/slideshow/catch-them-all-detection-engineering-and-purple-teaming-in-the-cloud/272701035\nwww.youtube.com/watch\nThe core idea was using open-source tools to simulate cloud attacks and then validate your detection rules…a proactive approach that I can appreciate. The introduction of the open-source project, Grimoire, which provides pre-built datasets of attack logs, was another great takeaway for turning the attacker’s playbook into a practical security roadmap."},"conferences/2024/2024-BSides-and-DefCon/Discover-the-hidden-vulnerability-interlligence-within-CISA's-KEV-catalog-Wednesday-2-30-PM":{"slug":"conferences/2024/2024-BSides-and-DefCon/Discover-the-hidden-vulnerability-interlligence-within-CISA's-KEV-catalog-Wednesday-2-30-PM","filePath":"conferences/2024/2024 BSides and DefCon/Discover the hidden vulnerability interlligence within CISA's KEV catalog Wednesday 2-30 PM.md","title":"Discover the hidden vulnerability interlligence within CISA's KEV catalog Wednesday 2-30 PM","links":["conferences/2024/2024-BSides-and-DefCon/2024-BSides-Vegas-and-DefCon"],"tags":[],"content":"… Back to 2024 BSides Vegas and DefCon …\nDiscover the Hidden Vulnerability Intelligence within CISA’s KEV Catalog\nGround Floor, 14:30 Wednesday\nGlenn Thorpe\nGlenn Thorpe’s talk on the CISA KEV catalog was a great deep dive into a data source that many of us in security rely on. As someone who deals with vulnerability management, it’s easy to treat the KEV as just a simple to-do list, but this session showed how to find real intelligence by looking at the metadata and trends. The most actionable parts were the hidden signals for prioritization, like the silently updated “known ransomware campaign use” flag, which is a critical piece of operational intelligence. The talk also pointed out how the required “time to fix” can indicate severity, with some vulnerabilities added on Fridays having a much shorter seven-day remediation window, giving teams the kind of non-obvious data points needed to make smarter, faster decisions."},"conferences/2024/2024-BSides-and-DefCon/Disenshittify-or-die!-How-hackers-can-seize-the-means-of-computation---Cory-Doctorow-Saturday-11-58-AM":{"slug":"conferences/2024/2024-BSides-and-DefCon/Disenshittify-or-die!-How-hackers-can-seize-the-means-of-computation---Cory-Doctorow-Saturday-11-58-AM","filePath":"conferences/2024/2024 BSides and DefCon/Disenshittify or die! How hackers can seize the means of computation - Cory Doctorow Saturday 11-58 AM.md","title":"Disenshittify or die! How hackers can seize the means of computation - Cory Doctorow Saturday 11-58 AM","links":["conferences/2024/2024-BSides-and-DefCon/2024-BSides-Vegas-and-DefCon","conferences/2023/2023-Black-Hat-and-DefCon"],"tags":[],"content":"… Back to 2024 BSides Vegas and DefCon …\nwww.youtube.com/watch\nThis follow-up talk from 2023 DefCon on dis-enshitification laid out the playbook for how platforms decay… they start by being good to users, then lock them in, and pivot to serving business customers before extracting all the value for themselves. He argued this is only possible because the four forces that used to discipline tech like competition, regulation, interoperability, and worker power have been dismantled. I remember the early days of the internet… Cory’s talk had a good call to action to restore sanity is a necessary path to keep our future well… ours."},"conferences/2024/2024-BSides-and-DefCon/Exploit-k8s-via-misconfiguration-.yaml-in-CSP-environments-Friday-125pm":{"slug":"conferences/2024/2024-BSides-and-DefCon/Exploit-k8s-via-misconfiguration-.yaml-in-CSP-environments-Friday-125pm","filePath":"conferences/2024/2024 BSides and DefCon/Exploit k8s via misconfiguration .yaml in CSP environments Friday 125pm.md","title":"Exploit k8s via misconfiguration .yaml in CSP environments Friday 125pm","links":["conferences/2024/2024-BSides-and-DefCon/2024-BSides-Vegas-and-DefCon"],"tags":[],"content":"… Back to 2024 BSides Vegas and DefCon …\nwww.youtube.com/watch\nThis talk was a deep dive into Kubernetes security, focusing on how simple misconfigurations in YAML files and RBAC settings can lead to major vulnerabilities. As a DevOps engineer, it was a good reminder of the fundamentals… things like setting allowPrivilegeEscalation to true or granting a service account the ability to list secrets can open the door for an attacker. The most interesting part was their research into CNCF projects, where they found these exact issues, which really drives home the point that you can’t implicitly trust default configurations, even from established projects."},"conferences/2024/2024-BSides-and-DefCon/Gone-in-60-Seconds…-How-Azure-AD-Entra-ID-Tenants-are-Compromised":{"slug":"conferences/2024/2024-BSides-and-DefCon/Gone-in-60-Seconds…-How-Azure-AD-Entra-ID-Tenants-are-Compromised","filePath":"conferences/2024/2024 BSides and DefCon/Gone in 60 Seconds… How Azure AD Entra ID Tenants are Compromised.md","title":"Gone in 60 Seconds… How Azure AD Entra ID Tenants are Compromised","links":["conferences/2024/2024-BSides-and-DefCon/2024-BSides-Vegas-and-DefCon"],"tags":[],"content":"… Back to 2024 BSides Vegas and DefCon …\nwww.youtube.com/watch\nThis talk, which I caught in the Cloud Village, was a deep dive into the kinds of Azure misconfigurations that are terrifyingly common in the wild. As a DevOps engineer, I’m constantly working with cloud identities, so seeing a breakdown of how easily nested groups and role-assignable groups can create unintended privilege escalation paths was very relevant. A key focus was on Conditional Access Policies, which are often the main line of defense but are frequently undermined by a web of complex exclusions. The session was a powerful example of how these seemingly small configuration details can create massive security holes."},"conferences/2024/2024-BSides-and-DefCon/Hacking-and-tracking-your-career-Wednesday-1-28-PM":{"slug":"conferences/2024/2024-BSides-and-DefCon/Hacking-and-tracking-your-career-Wednesday-1-28-PM","filePath":"conferences/2024/2024 BSides and DefCon/Hacking and tracking your career Wednesday 1-28 PM.md","title":"Hacking and tracking your career Wednesday 1-28 PM","links":["conferences/2024/2024-BSides-and-DefCon/2024-BSides-Vegas-and-DefCon"],"tags":[],"content":"… Back to 2024 BSides Vegas and DefCon …\nTracking and hacking your career\nHire Ground, 13:30 Wednesday\nLeif Dreizler, Misha Yalavarthy\nThis session with Leif Dreizler and Misha Yalavarthy was a solid, practical guide on taking control of your own career path. As an engineer, it’s easy to get buried in the day-to-day work and expect your manager to map out your growth, but this talk emphasized that the most effective approach is a collaborative one where you are in the driver’s seat. They laid out a clear method for translating a company’s career ladder into a personal Career Development Plan (CDP), which immediately struck me as a powerful tool for navigating promotions and performance reviews.\nI ended up jumping out of this session early, but basically it reminded me of a brag document that I use at work. - jvns.ca/blog/brag-documents/\nBy maintaining a plan and making your work visible through blog posts or internal wikis, the dreaded self-review process becomes much simpler because you’ve already gathered the evidence. They really summarized a good strategy that helps protect you from career setbacks when your team or manager changes, ensuring the person most invested in your career—you—is also the most prepared.\nHere’s the slides:\nstatic.sched.com/hosted_files/owaspglobalappseclisbon2024/b6/Leif_Misha_Lisbon.pdf"},"conferences/2024/2024-BSides-and-DefCon/How-We-Accidentally-Became-Hardware-Hackers-Tuesday-202-PM":{"slug":"conferences/2024/2024-BSides-and-DefCon/How-We-Accidentally-Became-Hardware-Hackers-Tuesday-202-PM","filePath":"conferences/2024/2024 BSides and DefCon/How We Accidentally Became Hardware Hackers Tuesday 202 PM.md","title":"How We Accidentally Became Hardware Hackers Tuesday 202 PM","links":["conferences/2024/2024-BSides-and-DefCon/2024-BSides-Vegas-and-DefCon"],"tags":[],"content":"… Back to 2024 BSides Vegas and DefCon …\nHow We Accidentally Became Hardware Hackers\nCommon Ground, 14:00 Tuesday\nKyle Shockley, Caleb Davis\nAs a creative person with a basement full of tech hobbies, this talk by Kyle Shockley and Caleb Davis was one I could immediately relate to. Their “buddy-film-esque” journey from making what they called “trash” hardware to becoming hardware hackers felt incredibly relatable. It’s easy to look at a field like hardware hacking and feel overwhelmed, thinking you need specialized, expensive gear and some kind of secret knowledge. Kyle and Caleb completely dismantled that idea by sharing their own laughable mistakes and endless dependency hells. Their core message was that every broken circuit and embarrassing security decision was actually a valuable lesson in disguise, building the exact skills they’d need later for cybersecurity.\nWhat I loved most was how they connected their electrical engineering background to the hands-on, practical skills of hacking. The experience gained from diagnosing incorrect component footprints or fixing a bad solder joint directly translates to the world of power analysis and fault injection. They reframed the idea of failure in a way that was relatable. Those frustrating moments when a project doesn’t work aren’t setbacks; they are the curriculum. This session was a fantastic reminder that the path into a complex field like hardware hacking is paved with trial, error, and the willingness to just dive in and learn from what you break."},"conferences/2024/2024-BSides-and-DefCon/Keynote,-Day-2-Homicideware-930a":{"slug":"conferences/2024/2024-BSides-and-DefCon/Keynote,-Day-2-Homicideware-930a","filePath":"conferences/2024/2024 BSides and DefCon/Keynote, Day 2 Homicideware 930a.md","title":"Keynote, Day 2 Homicideware 930a","links":["conferences/2024/2024-BSides-and-DefCon/2024-BSides-Vegas-and-DefCon"],"tags":[],"content":"… Back to 2024 BSides Vegas and DefCon …\nwww.youtube.com/live/KClU1DONInA\nKeynote, Day 2: Homicideware\nBreaking Ground, 09:30 Wednesday\nAndrea M. Matwyshyn\nAndrea Matwyshyn’s keynote was a sobering look at the evolution of security policy over the last 25 years. She made a compelling argument for reframing our industry’s mindset away from “cybersecurity” and towards a broader concept of “technology safety.” For those like me- building and maintaining systems, this talk was perfect. The scope of our work has expanded, with our code now deeply embedded in critical infrastructure like hospitals and transportation, where an outage can have serious real-world consequences. The talk drew a direct line from the engineering catastrophes of the past to the security incidents of today, showing that the root causes are often the same.\nThe 1919 Boston Molasses Disaster was a particularly effective historical example. Matwyshyn detailed how the company knew the storage tank had structural issues—locals even saw it leaking—but chose to paint over the cracks to meet wartime production deadlines instead of performing proper repairs. This story is an uncomfortably familiar parallel to modern software development, where teams often hide technical debt to meet a release date. The talk used this to show how the legal landscape is now shifting to catch up with technology. It was a strong reminder that the choices we make as engineers, and the risks we accept to meet deadlines, carry more weight than ever and are being scrutinized through a much more serious legal and public safety lens."},"conferences/2024/2024-BSides-and-DefCon/Kicking-in-the-Door-to-the-Cloud-Exploiting-Cloud-Provider-Vulnerabilities-for-Initial-Access-Sunday-10-52-AM":{"slug":"conferences/2024/2024-BSides-and-DefCon/Kicking-in-the-Door-to-the-Cloud-Exploiting-Cloud-Provider-Vulnerabilities-for-Initial-Access-Sunday-10-52-AM","filePath":"conferences/2024/2024 BSides and DefCon/Kicking in the Door to the Cloud Exploiting Cloud Provider Vulnerabilities for Initial Access Sunday 10-52 AM.md","title":"Kicking in the Door to the Cloud Exploiting Cloud Provider Vulnerabilities for Initial Access Sunday 10-52 AM","links":["conferences/2024/2024-BSides-and-DefCon/2024-BSides-Vegas-and-DefCon"],"tags":[],"content":"… Back to 2024 BSides Vegas and DefCon …\nwww.youtube.com/watch\ndefcon.org/html/defcon-32/dc-32-speakers.html#54449\nKicking in the Door to the Cloud: Exploiting Cloud Provider Vulnerabilities for Initial Access\nFriday at 12:30 in LVCC - L1 - HW1-11-03 (Track 3)\n45 minutes\nNick Frichette Staff Security Researcher at Datadog\n\nlink\nlink\n\nMastodon (@frichetten@fosstodon.org)\nTwitter (@Frichette_n)\nWebsite\nNick Frichette’s talk shifted the focus from typical customer misconfigurations to vulnerabilities within AWS services themselves. He demonstrated how a confused deputy vulnerability in AWS AppSync could be used to hijack IAM roles in other accounts… a powerful reminder that the services we build on can become the attack surface. His research into how AWS Amplify unintentionally exposed customer IAM roles further drove home the point that we need to be aware of the security posture of the cloud provider’s own tools, not just our own infrastructure."},"conferences/2024/2024-BSides-and-DefCon/Kubernetes-Attack-Simulation-The-Definitive-Guide":{"slug":"conferences/2024/2024-BSides-and-DefCon/Kubernetes-Attack-Simulation-The-Definitive-Guide","filePath":"conferences/2024/2024 BSides and DefCon/Kubernetes Attack Simulation The Definitive Guide.md","title":"Kubernetes Attack Simulation The Definitive Guide","links":["conferences/2024/2024-BSides-and-DefCon/2024-BSides-Vegas-and-DefCon"],"tags":[],"content":"… Back to 2024 BSides Vegas and DefCon …\nwww.youtube.com/watch\ndefcon.org/html/defcon-32/dc-32-creator-talks.html#54649\nKubernetes Attack Simulation: The Definitive Guide\nSunday at 11:30 in LVCC - L1 - HW4-04-02 (Creator Stage 3)\n30 minutes | Demo 💻\nLeo Tsaousis Senior Security Consultant at WithSecure on behalf of Adversary Village\nLeo Tsaousis\nLinkedIn\nTwitter (@LAripping)\nThis talk on Kubernetes attack simulation was a solid guide for taking a proactive approach to security. The emphasis on collaborative purple teaming and using threat modeling to understand your own environment before running simulations is a practical way to build better defenses. The quick demo for Atomic Red Team was pretty cool too and it gave me another tool to make these types of simulations easier to execute and validate our detection capabilities.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n"},"conferences/2024/2024-BSides-and-DefCon/Nothing-went-to-plan-because-you-didn't-have-a-plan-Wednesday-259-PM":{"slug":"conferences/2024/2024-BSides-and-DefCon/Nothing-went-to-plan-because-you-didn't-have-a-plan-Wednesday-259-PM","filePath":"conferences/2024/2024 BSides and DefCon/Nothing went to plan because you didn't have a plan Wednesday 259 PM.md","title":"Nothing went to plan because you didn't have a plan Wednesday 259 PM","links":["conferences/2024/2024-BSides-and-DefCon/2024-BSides-Vegas-and-DefCon"],"tags":[],"content":"… Back to 2024 BSides Vegas and DefCon …\nNothing Went to Plan….. Because You Didn’t Have a Plan\nGround Floor, 15:00 Wednesday\n0DDJ0BB\nThis talk by 0DDJ0BB was a much-needed, practical guide to incident response planning, a topic that’s critical for anyone in a DevOps or SRE role. The session cut through the usual complexity by framing the entire process with the simple “People, Process, Technology” model. This approach emphasized starting with people first—identifying your key contacts across the business in Legal, HR, and Finance before an incident strikes, not during the chaos. By establishing that human foundation, it becomes much more straightforward to define a clear process and apply the right technology, creating a simple, tested plan that is infinitely better than a perfect, unread one."},"conferences/2024/2024-BSides-and-DefCon/Organizers-Meetup-7pm":{"slug":"conferences/2024/2024-BSides-and-DefCon/Organizers-Meetup-7pm","filePath":"conferences/2024/2024 BSides and DefCon/Organizers Meetup 7pm.md","title":"Organizers Meetup 7pm","links":["conferences/2024/2024-BSides-and-DefCon/2024-BSides-Vegas-and-DefCon"],"tags":[],"content":"… Back to 2024 BSides Vegas and DefCon …\nIt was an incredible opportunity to be in a room with other BSides organizers from all over the world. With representatives from major events like Las Vegas, San Francisco, and even the other side of the planet, the depth of experience was immediately apparent. Our main reason for being there was to get a crash course for reviving BSides Detroit. Being able to hear firsthand stories about what works, what doesn’t, and the unique challenges different cities face was invaluable. The meetup provided a fantastic chance to absorb years of lessons learned and build connections with the people who are passionate about making these community-driven security conferences successful."},"conferences/2024/2024-BSides-and-DefCon/Pipeline-Pandemonium--How-to-Hijack-the-Cloud-and-Make-it-Rain-Insecurity-1030a":{"slug":"conferences/2024/2024-BSides-and-DefCon/Pipeline-Pandemonium--How-to-Hijack-the-Cloud-and-Make-it-Rain-Insecurity-1030a","filePath":"conferences/2024/2024 BSides and DefCon/Pipeline Pandemonium- How to Hijack the Cloud and Make it Rain Insecurity 1030a.md","title":"Pipeline Pandemonium- How to Hijack the Cloud and Make it Rain Insecurity 1030a","links":["conferences/2024/2024-BSides-and-DefCon/2024-BSides-Vegas-and-DefCon"],"tags":[],"content":"… Back to 2024 BSides Vegas and DefCon …\nPipeline Pandemonium: How to Hijack the Cloud and Make it Rain Insecurity\nGround Floor, 10:30 Wednesday\nBlake Hudson\nBlake Hudson’s talk on pipeline security was directly in my wheelhouse as a DevOps engineer. He walked through common vulnerabilities in CI/CD pipelines, covering the tools many of us use daily like GitHub Actions and Jenkins. The session focused on how the very automation that gives us speed can be turned against us, with attackers exploiting things like insecure secrets and overly permissive IAM roles to compromise cloud environments.\nThe real-world examples were the most valuable part of the session. Hudson demonstrated how an attacker could bypass weak secret masking with simple text manipulation, then create a new branch with a malicious workflow to exfiltrate credentials without ever needing a pull request. He also showed a case where a misconfigured trust relationship on a role allowed access from any repository in an organization, creating a persistent backdoor. These examples are a clear call for more rigorous security practices, emphasizing the need to lock down permissions and apply the principle of least privilege to every component of our CI/CD infrastructure."},"conferences/2024/2024-BSides-and-DefCon/Redis-or-Not-Argo-CD--and--GitOps-from-an-Attacker’s-Perspective-CVE-2024-31989-1030a":{"slug":"conferences/2024/2024-BSides-and-DefCon/Redis-or-Not-Argo-CD--and--GitOps-from-an-Attacker’s-Perspective-CVE-2024-31989-1030a","filePath":"conferences/2024/2024 BSides and DefCon/Redis or Not Argo CD & GitOps from an Attacker’s Perspective CVE-2024-31989 1030a.md","title":"Redis or Not Argo CD & GitOps from an Attacker’s Perspective CVE-2024-31989 1030a","links":["conferences/2024/2024-BSides-and-DefCon/2024-BSides-Vegas-and-DefCon"],"tags":[],"content":"… Back to 2024 BSides Vegas and DefCon …\nRedis or Not: Argo CD &amp; GitOps from an Attacker’s Perspective\nBreaking Ground, 10:30 Tuesday\nElad Pticha, Oreen Livni Shein\nThis session by Elad Pticha and Oreen Livni Shein was a real eye-opener, especially for anyone working in the GitOps and Kubernetes space. As someone who lives and breathes containerization and automation, I rely on pipeline tools to keep things running smoothly, so a talk focused on its security from an attacker’s perspective was right up my alley. They uncovered a critical 9.1 vulnerability that essentially turns Argo CD’s Redis cache into a backdoor. It was fascinating to see how, by manipulating data in Redis, an attacker could bypass validation checks and deploy their own malicious pods to potentially gain full control over the cluster. It’s a stark reminder that even the tools we trust for continuous delivery can have attack vectors we haven’t considered.\nThe biggest takeaway for me was the breakdown of the attack path and the practical steps for mitigation. Patching Argo CD to the latest version is the crucial first step. The talk also drove home the importance of applying core DevSecOps principles to the problem. They made a strong case for running Argo CD in a separate, isolated cluster and enforcing strict network policies to lock down access. The session was a powerful call to action to be more deliberate when architecting our GitOps environments, to always adhere to the principle of least privilege, and to question the implicit trust we place in every component of our stack."},"conferences/2024/2024-BSides-and-DefCon/Skytalks---Session-11-500p":{"slug":"conferences/2024/2024-BSides-and-DefCon/Skytalks---Session-11-500p","filePath":"conferences/2024/2024 BSides and DefCon/Skytalks - Session 11 500p.md","title":"Skytalks - Session 11 500p","links":["conferences/2024/2024-BSides-and-DefCon/2024-BSides-Vegas-and-DefCon"],"tags":[],"content":"… Back to 2024 BSides Vegas and DefCon …\nSkytalks. Last one I got to participate in. So, again, you know the drill - ya had to be there… and I’m glad I was there. This session was another good one, and it confirmed my own experiences that I’ve had while conducting interviews in the past year. Folks would join the interview and lip-sync to someone else who “knew” the answers.. like, yep, this whole talk confirmed that I’m not crazy, that it does happen and it’s a major issue… It’s an organized problem of state-sponsored actors getting hired into tech. Having dealt with this first hand? not fun."},"conferences/2024/2024-BSides-and-DefCon/Skytalks---Session-7-1030a":{"slug":"conferences/2024/2024-BSides-and-DefCon/Skytalks---Session-7-1030a","filePath":"conferences/2024/2024 BSides and DefCon/Skytalks - Session 7 1030a.md","title":"Skytalks - Session 7 1030a","links":["conferences/2024/2024-BSides-and-DefCon/2024-BSides-Vegas-and-DefCon"],"tags":[],"content":"… Back to 2024 BSides Vegas and DefCon …\nInsider Threat: The Unwilling Watchman - Session 7\nSkytalks, 10:30 Wednesday\nJohn O. THORNE\nSkytalks. You know the drill. Ya had to be there… and I’m glad I was there. This talk was a good one, it was a stark reminder of the ethical responsibility we have."},"conferences/2024/2024-BSides-and-DefCon/Skytalks---Session-8-1130a":{"slug":"conferences/2024/2024-BSides-and-DefCon/Skytalks---Session-8-1130a","filePath":"conferences/2024/2024 BSides and DefCon/Skytalks - Session 8 1130a.md","title":"Skytalks - Session 8 1130a","links":["conferences/2024/2024-BSides-and-DefCon/2024-BSides-Vegas-and-DefCon"],"tags":[],"content":"… Back to 2024 BSides Vegas and DefCon …\nHow the police use, misuse, and abuse your data - Session 8\nSkytalks, 11:30 Wednesday\nBluescreenofwin\nSkytalks. You know the drill. Another one where ya had to be there… and I’m glad I was there. This session was a crazy one with an eye-opening look into the wild west of data sharing between private companies and law enforcement."},"conferences/2024/2024-BSides-and-DefCon/Social-Engineering-like-you're-Picard-Friday-3-26-PM":{"slug":"conferences/2024/2024-BSides-and-DefCon/Social-Engineering-like-you're-Picard-Friday-3-26-PM","filePath":"conferences/2024/2024 BSides and DefCon/Social Engineering like you're Picard Friday 3-26 PM.md","title":"Social Engineering like you're Picard Friday 3-26 PM","links":["conferences/2024/2024-BSides-and-DefCon/2024-BSides-Vegas-and-DefCon"],"tags":[],"content":"… Back to 2024 BSides Vegas and DefCon …\nwww.youtube.com/watch\ndefcon.org/html/defcon-32/dc-32-speakers.html#54463\nJayson E. Street’s talk used AI for social engineering as a hook, but the core message was about shifting from corporate “security awareness” to practical “situational awareness.” Teach people to spot scams in their personal lives, and they’ll be better defenders at work.. right? Pretty simple? Seeing him use AI to instantly generate a legitimate-looking phishing site with his legit-looking persona was a cool example of how accessible these tools have become."},"conferences/2024/2024-BSides-and-DefCon/Tactics-of-a-Trash-Panda-Tuesday-5-PM":{"slug":"conferences/2024/2024-BSides-and-DefCon/Tactics-of-a-Trash-Panda-Tuesday-5-PM","filePath":"conferences/2024/2024 BSides and DefCon/Tactics of a Trash Panda Tuesday 5 PM.md","title":"Tactics of a Trash Panda Tuesday 5 PM","links":["conferences/2024/2024-BSides-and-DefCon/2024-BSides-Vegas-and-DefCon"],"tags":[],"content":"… Back to 2024 BSides Vegas and DefCon …\nTactics of a Trash Panda\nGround Floor, 17:00 Tuesday\nAngel Gamboa\nAngel Gamboa’s “Tactics of a Trash Panda” was a fun session that perfectly captured the spirit of creative problem-solving. As someone who spends a lot of time 3D printing and tinkering with electronics, the idea of ditching expensive, specialized entry tools for DIY alternatives is very appealing. The talk championed a “raccoon” mentality, focusing on how to be resourceful by turning everyday items from craft stores or even the trash into effective physical penetration testing tools. It was a great look into the practical side of hacking, showing how items like bobby pins, windshield wipers, and even polymer clay can be used to craft lockpicks or cast duplicate keys.\nThe presentation went through a number of clever, low-budget techniques, from using cornstarch for forensic analysis to building network monitoring tools with an Orange Pi instead of a pricier Raspberry Pi. The session was packed with useful demonstrations that drove home the point that resourcefulness and a willingness to experiment are more valuable than a bag full of expensive gear. It was a solid encouragement for any tech hobbyist to see how far creativity and readily available materials can take you in the world of physical security."},"conferences/2024/2024-BSides-and-DefCon/The-road-to-Developer's-hearts-Wednesday-1-56-PM":{"slug":"conferences/2024/2024-BSides-and-DefCon/The-road-to-Developer's-hearts-Wednesday-1-56-PM","filePath":"conferences/2024/2024 BSides and DefCon/The road to Developer's hearts Wednesday 1-56 PM.md","title":"The road to Developer's hearts Wednesday 1-56 PM","links":["conferences/2024/2024-BSides-and-DefCon/2024-BSides-Vegas-and-DefCon"],"tags":[],"content":"… Back to 2024 BSides Vegas and DefCon …\nThe road to developers’ hearts\nGround Floor, 14:00 Wednesday\nSing Ambikapathi\nThis talk from Sing Ambikapathi was a great look into the human side of DevSecOps, focusing on how to bridge the gap between security and development teams. Coming from the perspective of a developer who moved into security, their points on building trust felt very authentic. In my own work, I see how the relationship between teams can make or break a project, and this session reinforced the idea that being available and responsive is one of the most effective ways to build that trust. It’s a simple concept, but it’s crucial for creating an environment where developers feel comfortable raising security concerns early.\nThe session also provided some solid, actionable advice for security practitioners. A key point was the need to provide specific, realistic recommendations and avoid the vague “it depends” answer that can stall progress. The talk also covered the importance of finding allies within development teams and mentoring those with an interest in security. This approach of embedding security champions within the culture (like what I do at work) is a far more sustainable way to improve an organization’s posture than simply escalating issues or relying on top-down mandates."},"conferences/2024/2024-BSides-and-DefCon/Unexpected-Leaks-in-AWS-Transit-Gateways-Sunday-12-35-PM":{"slug":"conferences/2024/2024-BSides-and-DefCon/Unexpected-Leaks-in-AWS-Transit-Gateways-Sunday-12-35-PM","filePath":"conferences/2024/2024 BSides and DefCon/Unexpected Leaks in AWS Transit Gateways Sunday 12-35 PM.md","title":"Unexpected Leaks in AWS Transit Gateways Sunday 12-35 PM","links":["conferences/2024/2024-BSides-and-DefCon/2024-BSides-Vegas-and-DefCon"],"tags":[],"content":"… Back to 2024 BSides Vegas and DefCon …\nwww.youtube.com/watch\nWilliam Taylor’s talk on AWS Transit Gateways was a perfect case study in the gap between design and reality. He walked through a security assessment where a client’s supposedly isolated environment was completely exposed due to a misconfigured NACL. The core issue was a misunderstanding of how Transit Gateway attachments interact with subnets… a small detail that rendered their entire network segmentation useless. For me, this is a good lesson/reminder… you can’t just trust the infrastructure-as-code or the design diagrams; you have to do the practical testing to find the unexpected leaks."},"conferences/2024/2024-BSides-and-DefCon/Voter-village-talk-with-secretary-of-state-new-hampshire-Saturday-at-2-07-PM":{"slug":"conferences/2024/2024-BSides-and-DefCon/Voter-village-talk-with-secretary-of-state-new-hampshire-Saturday-at-2-07-PM","filePath":"conferences/2024/2024 BSides and DefCon/Voter village talk with secretary of state new hampshire Saturday at 2-07 PM.md","title":"Voter village talk with secretary of state new hampshire Saturday at 2-07 PM","links":["conferences/2024/2024-BSides-and-DefCon/2024-BSides-Vegas-and-DefCon"],"tags":[],"content":"… Back to 2024 BSides Vegas and DefCon …\nThe talk centers around the importance of election security and voter confidence in the United States, specifically highlighting the speaker’s experiences as the Secretary of State in New Hampshire.\nThe speaker emphasizes the unique nature of New Hampshire’s election process, where local officials elected by their communities hold significant responsibility in administering elections. This decentralized system, while contributing to a strong sense of local control, also presents challenges in maintaining transparency and addressing voter concerns. The talk then focuses on two key areas of concern that emerged in recent elections: voter confusion surrounding ballot counting machines and absentee voting procedures.\nHere are some key takeaways and big items from the talk:\n\nThe importance of transparency in the election process, particularly around ballot counting and absentee voting.\nThe need for voter education to address misconceptions and build trust in the electoral system.\nThe increasing use of technology in elections and the importance of addressing vulnerabilities to maintain security and integrity.\nThe impact of misinformation and disinformation on voter confidence and the importance of combating these threats.\nThe need for respectful dialogue and collaboration between individuals with differing viewpoints to address challenges to election integrity.\nThe critical role of volunteers and local election officials in ensuring fair and accurate elections.\nThe potential for human error in the election process and the importance of checks and balances to mitigate risks.\nThe need for continued efforts to engage voters and promote participation in the democratic process.\n\n\n[Speaker 1]\nYeah.\n[Speaker 1]\nShe was like, you know, yeah.\n[Speaker 1]\nHello. Hello! Everybody hear me. Hi, I’m\n[Speaker 2]\nSo excited to introduce our next speaker. Uh, secretary Scanlon has served the state of New Hampshire as the Secretary of State since 2022, which he was elected elevated to Secretary of State due to the retirement of one of the country’s longest, serving secretaries and State Bill Gardner Secretary of Scandler, as Deputy secretary for As many duties has been to oversee and lead elections in New Hampshire, a secretary in a state that every four years is spotlighted holding the first in the nation presidential primary. He knows firsthand the importance of every election, his leadership and oversteem transparent. And secure elections is just one of his many accomplishments secretary, scamlanch continues to serve the lead, the nation, in Innovative ideas and program.\n[Speaker 2]\nSecurity. He recognizes the need for discussion in a respectful space. He appointed a voter confidence committee to meet in all corners of the state to understand the challenges and have the tough discussions. Realizing the importance of everyone’s voice, he appointed people with bats, differing opinions, those questioning the election process and those that trusted it this committee when a great distance and turning down the temperature of the discussion, understand And how they work with the focus on gaining, a more respectful debate. He also appointed the states. First adverse Civics education, voter coordinator, secretary, Scanlit, and graceless, technology and respects the power and responsibility. That attaches with it. He led the nation through one of our nation’s first 81 generated Robo, call replicating, President, Biden’s, voice and Beckham in an attempt to misle\n[Speaker 2]\nMe and give a very very warm welcome for the Secretary of State from New Hampshire, Dave Scandal.\n[Speaker 3]\nThat’s great.\n[Speaker 1]\nThank you Catherine. It’s a real pleasure for being to be here today to speak to this group. This is the first Defcon that I’ve attended, and I can tell you, it’s pretty, it’s really pretty amazing. And I’m sure I just scratching surface when actually takes place here. I’m not going to assume that everybody knows what a secretary of State does. So let me just take a second to say that most secretaries of state are an agency had in state government. And we have many, although the ministerial duties, we do things like register business entities to not operate in the state, a corporation or\n[Speaker 3]\nLLC\n[Speaker 1]\nPartnerships, things like that. We have a records management division\n[Speaker 3]\nWhich\n[Speaker 1]\nAlso allows Uh, so\n[Speaker 3]\nWe came to space most important programs. We have a division of Vital Records to keep track of\n[Speaker 1]\nFirst fat, spirits and verses life events basically. And you can see where I’m located is kind of a one day, job keeping right at this point but then many Secretary of States also have responsibility of administrative relations. And then sure I may achieve the life officer\n[Speaker 3]\nOf the\n[Speaker 1]\nState. So the lifestyles are my best when they were a big election related editions and almost The country has so\n[Speaker 3]\nMany responsibilities but not all social terms will stay administer election, some stays on the board of elections\n[Speaker 1]\nAnd they may not have that responsibility. Some states, Trump secretaries of State, and National Border vehicle and registrations inside. Every action does not And each state, Alexis Secretary of State differently in New Hampshire on one of three secretaries around the country. They’re actually elected by the state of legislation. So after the general election is over the new members, take our seats, they usually elect their chamber officers and then they elect constitutional officers in New Hampshire as the Secretary of State and Penn State Treasurer many secretaries of state run at large and the general election Network. And they are\n[Speaker 1]\nPrivacy basis. And, you know, they represent your party if they have their parties nomination on the general election ballot, Elected that way. And then there are some that are appointed by the government and then there are a couple of states where the lieutenant, you know automatically serves as the Secretary of the state. The way, the secretary’s administer elections and their individual states, that are also different Many states, especially when you get What’s the Mississippi River? Have major County election organizations and so on the Secretary of State and a general oversight over the process, there are actually County election administrators that are responsible thing for things like printing ballots deciding which voting machines or ballot accounting devices going to use that election and things like that in New Hampshire. We’re we are a small state of geographic\n[Speaker 1]\nWe have 1.4 million voters and that means that there are many cities in this country that are actually larger than the population of the state of the national. Watching the process goes back to Colonial times when there is a general mistrust government in some ways, it’s terrible to, we’re allow people are feeling today. 400 number of House of Representatives, in the state with that population 1.4 million If California had that same type of representation, they would have a legislature that is an assessment. I think it’s 15 000 legislators. And so, that’s because When our state constitution was created and that mistrust of government,\n[Speaker 1]\nUh, was there. The forefathers at the time decided that they were going to spread the power government as broadly across the population as they could and they did a good job with it. It was still in effect today. And that’s the way we do business. Our election is the process is also very soon every town. And sitting here. Is a common place in New Hampshire and every polling place in New Hampshire is collects from its citizens. Its both of them, the moderator, a town, clerk three supervisors of a checklist And all of our election officers.\n[Speaker 1]\nThey are elected by their neighbors families, people in the community that believe that they have the honesty and integrity and the capability to do a good job, running an electrical process. Could literally be impossible in my opinion to have any kind of broad conspiracy in our state related to on the election process. Every town, every, every polling place decides whether or not they are going to use. Electronic Valley County device in your jurisdiction, so that is a local decision. And New Hampshire is currently the process for placing the old Macy Road, OS devices that are on table in here. And the other one, with a couple of pure origin, digital stem devices, which have just been recently approved by the state law information. So that’s kind of the nature of how the election process.\n[Speaker 1]\nTo go into this part by telling you the story about an event that happened during the 2020 general election in New Hampshire. And if you recall the 2020 election was the pandemic election. New Hampshire is a state where to vote my mail absentee, you have to have an experience. And the excuses, you don’t have to be absent or you have a disability.\n[Speaker 3]\nAnd\n[Speaker 1]\nThen the statutes kind of break those two categories down. For example, it is a more specific plan. Attorney, general, and Governor determined that, because of the pandemic, It was a major public health crisis. And that if voters in the state, I felt unsafe by going out of public mode that they could use that as a reason to go by accident the way as it was a form of disability, I suppose you had that medical tradition that you were concerned about And because of that, we had it three times the number of absentee ballots that were normally cast in an election. So after the election took place, we had a town on Massachusetts Florida and then they would win some of them. I have heard of it and the results were hosted and I and New Hampshire is the opinions process promoting. Also, Einstein voters show up to check in A\n[Speaker 1]\nThese girls with them, they put balance, you know, one before all the counter devices. Today is the poor place, but then the poles flows. We have the moderator against the results. Take off with those places ads, then in a hand count votes, And then they push the results to the point place. Before they post companies. So the voters know what the results were for, that public place and then that exact paperwork. So the Secretary of State following Mortgage that we can certify those results in Windham, there were four states or state representatives, and or elections. So I went to collectible uh for Southern Senator East and in that election for Republicans candidates want\n[Speaker 1]\nUh, president that was 24 hours from and this is the town where they were probably over 5 000 volts across right under the largest. So she naturally requested Harry Academy that they had was ever failed and then kind of a large amount Hospital and the recount is hell. And in New Hampshire, the way we conducted recap is when we’re seeing Alex from town work, we also artists in public, we we\n[Speaker 1]\nTime. So that it happened or the representatives and see every single part on those ballots. And now those calls for pounding So, when a recount was over, Went for 24 months, 2 400. Yeah. And they say, absolutely no explanation, as to why they haven’t had a, you know, the process frame would smoothly and appealing like the same amber ballots. Also Orchest in the garage\n[Speaker 1]\nYeah. And there was no explanation and still saying I don’t have Animals became to no conclusions. We didn’t speculate the blind end and spread to advice. But that’s the way it was but it’s only provision. You can at that point, I mean, and it’s a recount was appeal to the power organization which is we broke the appealand promises, but the bad luck. We should have no amount of information and we have to bring out to change the outcome of the repair. So\n[Speaker 1]\nAnd in the legislature and especially because at that time we had no model opportunity. Broward County crisis and so the legislature in the January and they quickly passed the bill they call for a foreign of that particular election. And the statement, you know, an extra encounter like you can show us how our worst team to be the representative of the state. And then the town, I chose in Oregon, another little uh, computer scientist. And then the two of them do that together were an extension for the third, which was called to start. And so it would be three of them was together as the organized style of writing about it which Market tapewise.\n[Speaker 1]\nAnd they were ridiculous wanted to report, valid reviewing every member in time. Looking at the code, They digitally scan all the ballots. Years in the election. And when it was all done, after about three weeks, a lot of screaming. Um, it came down to human error. Is what they found out was. There was a priestron where the absentee that was followed him, that went through one of the Target robots. For that Democratic campus that has close race and where that place between the target level and the motor has not filled in and over both of that person. It was enough of a shelling if it’s falling on the Prius Adam was dating, right? Bye guys. As a book and so we counted the votes. Obviously we are not ratings.\n[Speaker 1]\nAnd I’ll explain the best friends, because It was that the town court was going down excited because of a huge number of absolutely habits. If they were dealing with that, that instead of hand, folding each ballot on the score line of answering the Press, that intentionally described her throughout the Target on Nissan. And she decided to use an uncalibrated bladder folder to follow your values. And when that was the reason why the line was going to retard, You can imagine a conspiracy theories that were taking place. Wildlife situation existing and in fact, they have not gone away and that’s the unfortunate thing about, you know, this process.\n[Speaker 1]\nAnd the mistakes that are potentially are coming back really cause problems in your future. In New Hampshire. And I think this is true in just about every state We rely on a lot of volunteers towards homes. I mentioned to you the first about 10 local officials that were elected to do each trial, but it is on a part-time basis and then they have, they had to find other individuals to put in on how to add classes especially in the larger times do that job and so the president process and because there’s still set up. Has to take place. This seems for me.\n[Speaker 1]\nAnd I passed away a lot of times bigger song. I don’t understand to be perfect. They were designed to accurately reflect his outcomes of our elections were. So now we have that human factor, founded off against technology and people believe the technology shouldn’t be growing. So we have these two systems that are now coming together and a trick that we have as a Def\n[Speaker 1]\nThe human finances and there are mistakes that are That this process is perfect and that’s the reason why the recounting appeals and things like that just to make sure that we get it right. So, These are really challenging times to be an election administrator as our politics. We’re so polar on this, and in that process, the election process, which was a sleeping thing that we did. Every company University, people trusted the results. And, and you know, there were emotions, ever since 2000 and Power, there has been a lot of screwdry and got your process. There’s a lot of information.\n[Speaker 1]\nOf private systems were\n[Speaker 1]\nAnd so we’re in a situation and the elections themselves are becoming Buddhistars, the parties have realized that, you know, making control of these. It’s been nothing in the elections. They might be able to raise indefinity, you know, if their person is where their team is, you know, in that position. So there’s all of the political climate is just challenging but yes.\n[Speaker 1]\nAnd I have built them changed together that as people that are registered in both local parties, and we treat every legislator and same night, and we just try and do the best job that we can at. Ministering the laws around the house. Happy Christmas time. The other thing as we were trying to do is get a dialogue line. The individuals that have these ideas care issues or the electrical process and, and the general loaders. I hope everybody understand how these processes work. So as Catherine mentioned, in my introduction, I put together what I call the special committee on voter confidence to try and get that discussion and dialogue of government. And the way it work goes, I chose four dimensions from local commodities here. And I tried that the whole an angel of a very liberal to very concerned with, to the election of the higher. The people that\n[Speaker 1]\nWe had set up a table for the previous Mage. They were actually rearranging their name tags on the particular example, because there were certain people that victimized sickness At least and they traveled around State, New Hampshire. And they held a number of hearings that were And each hearing was set up so that the first half of it was to hear from experts in the field. So, we had some sessions that included the chairs of the political parties. We had a session that dealt with pollsters coming in. We’ll talk about election tracks. We had academics payment to talk about how they were seeing in the political science sector.\n[Speaker 1]\nElection officials. And then in the second half. We open lots of the park and what was great about that? Was that we had a whole range of political theories, representative by people, that wanted to show that and speak. And in a way it allowed them to vent. Although the discussion, mostly, it was very civil. But I got the sense that the people appreciated\n[Speaker 1]\nAnd after saying that, I don’t think we do that enough. That’s a really important thing that government needs to take the time to bless again. So the committee travel around the state, and by the end, by the 12 trip, they were heartbling, insane van, stopping the restaurant to eat and become social event for them, which was really rewarding to see. And as they became friends, They could have discussions and disagree, like they weren’t disagreeable. Interact. And so they eventually wrote a report. That was filled with probably 24 25 recommendations and how do we could improve the electric process and get people on the board to, you know, to work together and trust the electrical processes.\n[Speaker 1]\nIt was almost unanimous there was, there was just one individual who wouldn’t sign on to a group of people but did write a An alternate report which agreed pretty much about 90 percent, but what was able to work. And so I I consider that a huge success. We spent the next two years at my office, working with the legislature and things that I can build in my office without any positional authorization to start addressing the issues. Okay. Is so what were the to me? There were, there were a couple really Oh, I have for that is level one. Is that where we have issues with the election process or where there are parts of that process that are not mentally transparent for Motors and cellulars, can’t really see what’s going on or understanding and some examples of that are valid body devices. Where’s God, and Martha, Ballard, and put their pallet and the Machine and it goes in there. And\n[Speaker 1]\nWell, so they don’t know. So that’s a big issue. The other, the other issue is absentee bone is how it’s actually lead the protection of the top Target, but they go out there and somebody gets sometimes that And we trusted New Hampshire. That the iceberg are very close by now, there were some checks and balances on that process. Because the average voter doesn’t seem to across its owners. And then when they hear voters in New Hampshire in here, about things like file harvesting and drop boxes, famous and other parts of the country. They think that it is automatically happened in New Hampshire and those are areas that I put in the trash there in\n[Speaker 1]\nSo, The efforts that we have been engaging in is two main categories, one, Is. Make the process as transparently as possible. Because there should be no secrets that I have the offering crisis for us. The only thing I truly secret is how we’re going to become actually work with our employees. And then the other part of it is to educate the public the voters on how the processed workers most voters in a miniature. I’m sure elsewhere around the country are walk in the quiet place and get their ballot and Market put it in and\n[Speaker 1]\nIf they don’t know that there are built in checks and balances that are working with home. Places that, for example, the book reporting is a petrol point. The individualists will serve just developers. Of course that depends on the battle on the other one is part of the name. Most voters have no idea, but with their future is right there, but the political authorities, schedule, appoint a official Challengers. So they can have individuals that\n[Speaker 1]\nMuch so that they can see and hear who is going through a voting in that particular election. And then we have taken the extra initiative. Doing a lot more than social media. Sort of putting off election facts on tracks by elections, just spraying. A lot of information, basic information about how elections run and operate so that the voters can understand it. We’re engaging, we are engaging students and the schools at all level all levels. But we have a really great minorities. Different contest that generated interest male entry schools, thousands of students submitted at We recently hired a sentence and motor education. I am here. Who’s going to reach out on starting departments that about election related, studies corporate, and the school systems. And that really long beyond that, where we are going to reach out to veterans groups, which we are pointing out to service groups like Lions Club, produce and Mars, senior senior citizenships,\n[Speaker 1]\nNot only to participate more in front of voting. And take it one step further. Actually, engage into plexus and publicly learning an election soon as a board because the more we can get people to actually participate in in an actual election. They walk away at him, the bank knowing that\n[Speaker 1]\nAnd I think that’s the key. There’s no question in my mind that we have a long material of effective in the diverse viewpoints that we have the election process of Soviet degrade at this point, that it’s going to take some time to use, but we’d have to get back to a point where faithful here, uh, faith and trust religious process and most of you, those of you that are good that are hackers that make you up here because she is up there.\n[Speaker 1]\nThese systems that are developed some companies like proprietary software and it’s part of the transparency issue, that’s a problem. And so to the extent that you can, hopefully, have vulnerabilities and violence for those machines and identify them, then we can take that information, prices are safe and accurate habit. I can’t remember, I could results in your work job. So I’m going to take a break from Child Car. I refuse to be more interactive.\n[Speaker 1]\nThank you so much.\n[Speaker 4]\nIt’s very interesting to hear on the season for the Dutch electoral council. So it’s kind of similar to your office I think but please wallet. So I was wondering, you were talking about um like the people that wrote the report they said there was a lack of transparency and they referred to Balance County machines and you. Yeah, you you said you’re well for transparency. So how did you change the election process? What what are our dates to the counting? The development machines. How did you provide or transparency for Motors?\n[Speaker 1]\nThat’s a great question about you. I’m glad you’re asking number. One is New Hampshire is now the legislature that has passed all calling for Autumns for Ally County devices in library. And that’s really important time. It’s going to take us some time to properly, develop it because In from the order, right? You have to own optimate scan device to two newer visitor, scan analysis and that digital scan opportunity does kind of really open opportunities for the types of events that might be development in New Hampshire, we still will sometimes and counter values because some of the public places are actually quite small. And really can’t justify our past, just the car Shield or the other great thing is\n[Speaker 1]\nI saw user’s open source software in recovery. So anybody that is the technical ability to entire to see how everybody is counted. Balance has an opportunity to do so those are initial steps but with spending on the way out,\n[Speaker 1]\nThanks\n[Speaker 5]\nFor your talk. We didn’t, um, talk so much about this, but cat touched on it in the introduction about the AI, uh, experience. That happened in New Hampshire and I wondered and I recently departed Justice issued a letter of an unstated and choice for somebody in in that situation. So I was wondering if you could talk a little bit about that,\n[Speaker 1]\nOkay? So\n[Speaker 1]\nA pre-framing experience been. It happened was to wake up on the morning before. New Hampshire. First in the nation, has such primary with the reporters for the media calling in along with voters, in the state of New Hampshire, talking about this call, there was received with President Biden’s voice That was. Tell me, borders. The presidential primary was not that important. Then the general election was again report that they should save their vote and vote into the background and along with Ms. Prego obvious form of motor suppression and I think most voters kind of scratched their heads when I heard the message.\n[Speaker 1]\nBut the there was, there was a spoofing and phone number in that a call a caller, my name was showing the call was coming from a former state of New Hampshire Democratic, charity of the party. And so, she was getting a lot of policy. Why are you? Why are you sending me this call as it by its voice? The A’s office attorney general’s office, in New Hampshire. It came out very quickly with messaging that said, To call us informative separation. It was illegal and then people should ignore it. And then I was able to amplify that message because all of the national media were in New Hampshire, followed across the primary election. And to them, this was my base scores. And so we were able to have interviews and that lesson job. It was it was very widespread. So I can’t say that there were some voters that were fooled by that call.\n[Speaker 1]\nBut it did not get back, the outcome of the elections so which was not very positive thing.\n[Speaker 1]\nThe, the Attorney General’s office was able to utilize resources and vendors. To identifying where the marking from. Identify companies that are responsible for actually creating with artificially generated voice. Joe Biden. And they were able to First find individuals that was paid, 150 dollars to make the call and then they were able to find him a the app and the call was made from and were able to locate the source of mobile buyer. And they finally found the individual is responsible for the whole final. Who is now facing a couple of times ago. Six million dollars in.\n[Speaker 1]\nFederal election, commissioner clients. So, the person is pretty much trouble.\n[Speaker 1]\nThis is the thing about that whole issue. Now it is You that the cost office of foreign disinformation and misinformation. But if that is nothing available, candidates such as playing dirty tricks, in other candidates, since we’ve been happy elections and so in that regard, he took place. There’s nothing to do what was different. However, it was the rapid use and expensive technology that that created this life. Messaging. And you can picture it and they Similar phone message by using the actual image of my candidate or an election official. I had been saying something. Where the event or the message?\n[Speaker 1]\nYeah, that’s that’s something that that I think we have to really look at and figure out how you were going to address. And I think that’s something that’s going to evolve the world and New Hampshire, as a result of that New Hampshire that passing a lot that requires and certain instances that it must be disclaimer organization. And artificial intelligence was used to generate\n[Speaker 1]\nGood guys are going to follow uh, Delicious diapers. So that’s that’s the state of where that’s pretty much.\n[Speaker 1]\nThat’s\n[Speaker 6]\nWonderful idea about all the work going. I wonder if you’re all about the work that’s going\n[Speaker 7]\nOn because you’re being able voters and safety of voters confidence and to enable them. But but I’m curious about the attorney’s, generals and others in some places that are not a lot of impact kids, or what your thoughts on that. Are you agree with my feelings on that?\n[Speaker 1]\nUm,\n[Speaker 1]\nWe have a very good relationship. The Secretary of State in New Hampshire is responsible for the manuscript which follows and attorney general relates to their expensively enforcing power. So, we become aware of initial evaluation is standing along with the matchments that we will.\n[Speaker 1]\nInappropriate activities, stop the line. And then, there are two people responsible employing and prosecute. This chair is a\n[Speaker 1]\nThis is I think participline when they finished it, if I made the statement and everybody was qualified for whatever applications in this country released past that should have the opportunity to easily exercise for like the public. I think there would be pretty achieve the rest of the brain. Can you believe it? I think, if I made a similar statement it said and it was fair.\n[Speaker 1]\nAnd then those individuals will qualify. Will receive some some universal accomplishment but yeah, you know, only vehicle involved are grants that should be building in this country. Problem that we have. But I think this is someone that are the issues that we face today. Is that there’s a tension between those two."},"conferences/2024/2024-BSides-and-DefCon/Zero-downtime-credential-rotation-Tuesday-2-56-PM":{"slug":"conferences/2024/2024-BSides-and-DefCon/Zero-downtime-credential-rotation-Tuesday-2-56-PM","filePath":"conferences/2024/2024 BSides and DefCon/Zero downtime credential rotation Tuesday 2-56 PM.md","title":"Zero downtime credential rotation Tuesday 2-56 PM","links":["conferences/2024/2024-BSides-and-DefCon/2024-BSides-Vegas-and-DefCon"],"tags":[],"content":"… Back to 2024 BSides Vegas and DefCon …\nZero downtime credential rotation\nPasswordsCon, 15:00 Tuesday\nKenton McDonough\nAs a DevOps engineer, the topic of credential rotation is one of those things we all know is critical but often gets pushed down the backlog. The fear of causing downtime or breaking a complex system just by changing a password is very real.. it’s in the category of “things that keep me up at night”. Kenton McDonough’s talk tackled this problem head-on, providing practical strategies for rotating credentials without needing to schedule a maintenance window. The session laid out a clear case that with the right design patterns, like blue-green deployments or derived credential rotation, any system can be built to handle this process seamlessly.\nA particularly useful point was the emphasis on treating service accounts differently from user accounts, focusing on monitoring their behavior rather than applying strict lockout policies that can cause cascading failures. The talk also served as a good reminder that even with tools like secret managers, we have to plan for their potential failure. Ultimately, the exercise of designing for zero-downtime rotation forces you to uncover system weaknesses and better understand your failure points, which is a valuable outcome for improving overall system resilience."},"conferences/2024/2024-Codemash/2024-CodeMash":{"slug":"conferences/2024/2024-Codemash/2024-CodeMash","filePath":"conferences/2024/2024 Codemash/2024 CodeMash.md","title":"2024 CodeMash","links":["conferences/2024/2024-Codemash/Building-Applications-on-Top-of-Large-Language-Models-(LLMs)-(Part-1)","conferences/2024/2024-Codemash/Binary-Analysis---Learn-to-break-stuff","conferences/2024/2024-Codemash/Mad-Scientist-Lab-With-Raspberry-Pi-Pico-Microcontrollers","conferences/2024/2024-Codemash/Thinking-Architecturally","conferences/2024/2024-Codemash/Java-Anti-Patterns","conferences/2024/2024-Codemash/Verbs,-not-nouns--Writing-documentation-users-want-to-read","conferences/2024/2024-Codemash/Managing-a-Rewrite-Without-Getting-Stuck-in-the-Tar-Pit","conferences/2024/2024-Codemash/Isn't-it-time-to-ditch-code-coverage--Focus-on-high-value-tests-instead","conferences/2024/2024-Codemash/Dev-containers--What-are-they-and-why-do-you-need-them","conferences/2024/2024-Codemash/Out-of-Control--How-to-rescue-a-struggling-software-project","conferences/2024/2024-Codemash/Alerts-don't-suck.-YOUR-alerts-suck","conferences/2024/2024-Codemash/Writing-Secure-APIs---A-Look-at-the-OWASP-2023-API-Top-10-List","conferences/2024/2024-Codemash/Platform-as-a-Product--The-future-of-Agile-and-DevOps"],"tags":[],"content":"Tuesday:\nAM\nBuilding Applications on Top of Large Language Models (LLMs) (Part 1) (no notes to share; this was interactive 4 hr training block)\nPM\nBinary Analysis - Learn to break stuff (no notes to share; this was interactive 4 hr training block)\n\nWednesday:\nAM\nMad Scientist Lab With Raspberry Pi Pico Microcontrollers (no notes to share; this was interactive 4 hr training block)\nPM\nThinking Architecturally\nLIGHTNING TALKS ⇐ I was mentioned in one of the talks by a long-time codemasher (twitter.com/minsko) as “the girl with the NFC tag in her hand”\n\nThursday\n8-9\nJava Anti Patterns (took a few pics of slides, but left early)\nVerbs, not nouns- Writing documentation users want to read\n9:15-10:15\nManaging a Rewrite Without Getting Stuck in the Tar Pit\n10:30-11:30\nIsn’t it time to ditch code coverage- Focus on high value tests instead\nLUNCH\n11:45-12:25\nSKIPPED SESSION: Talked to k3s speaker (Chris)\n1:00-2:00\nDev containers- What are they and why do you need them\n2:15-3:00\nSKIPPED, This was a sponsor session hour.\n3:30-4:30\nOut of Control- How to rescue a struggling software project\n4:45-5:45\nAlerts don’t suck. YOUR alerts suck\nDINNER\nATTENDEE PARTY\nSECRET RAVE\n\nFriday\n8:30-9:30\nWriting Secure APIs - A Look at the OWASP 2023 API Top 10 List\n9:45-10:45\nPlatform as a Product- The future of Agile and DevOps\nDROVE HOME EARLY: SNOWSTORM!\n\nCurious about other things that went on?\nHere’s all of the presentations that speakers provided slides for:\ncodemash.org/2024-session-slides/"},"conferences/2024/2024-Codemash/Alerts-don't-suck.-YOUR-alerts-suck":{"slug":"conferences/2024/2024-Codemash/Alerts-don't-suck.-YOUR-alerts-suck","filePath":"conferences/2024/2024 Codemash/Alerts don't suck. YOUR alerts suck.md","title":"Alerts don't suck. YOUR alerts suck","links":["conferences/2024/2024-Codemash/2024-CodeMash"],"tags":[],"content":"… Back to 2024 CodeMash …\nThis presentation was recorded elsewhere:\nyoutu.be/vtE-TFblEgE\nOut of all the sessions, this is one that I would highly recommend everyone to watch the recording that was posted from another session and is hosted on youtube.\nAlerts should provide value to the recipient, or they are useless. They should be actionable, relevant, timely, and clear.\n\nAlerts should be actionable. The recipient should be able to take some action in response to the alert.\nAlerts should be relevant. The recipient should care about the information in the alert.\nAlerts should be timely. The recipient should receive the alert in a timely manner so that they can take action before it’s too late.\nAlerts should be clear. The recipient should be able to understand the alert and what action to take.\n\nAdditional points:\n\nAlerts should be tested regularly. Test that the right person receives the alert and that they can take the appropriate action.\nAlerts should be prioritized. The recipient should be able to tell which alerts are most important and need to be addressed first.\nAlerts should be documented. The recipient should have access to documentation that explains what each alert means and what action to take.\n"},"conferences/2024/2024-Codemash/Binary-Analysis---Learn-to-break-stuff":{"slug":"conferences/2024/2024-Codemash/Binary-Analysis---Learn-to-break-stuff","filePath":"conferences/2024/2024 Codemash/Binary Analysis - Learn to break stuff.md","title":"Binary Analysis - Learn to break stuff","links":["conferences/2024/2024-Codemash/2024-CodeMash"],"tags":[],"content":"… Back to 2024 CodeMash …\ncodemash.org/session-details/\nBinary Analysis - Learn to break stuff\nPresented by: Jason Slagle, John Hammond\nTime: Tuesday, Jan. 09, 1:00 PM - 5:00 PM\nIn this Pre-Compiler, we’ll take a dive into the world of reverse engineering.\nWe’ll start with DotPeek and reverse engineer a handful of binaries, starting with simple and ending with somewhat more complex examples with some obfuscation. We’ll also discuss problems in these tools and techniques malware authors use to avoid analysis.\nAfterward, we’ll really get our feet wet with Ghidra. We’ll look into reversing some C binaries, C++, and Go.\nIf time allows, we’ll look into more complicated examples of malware analysis and level up skills all around.\nSome knowledge of C# and x86 assembly is helpful but not required! Come out for a half day of reverse engineering fun!\nRoom: CypressTags: Hardware, SecurityLevel: Intermediate\n\nREQUIREMENTS\nWe’d prefer the attendees have a way to run Linux binaries - this can be Windows Subsystem for Linux (learn.microsoft.com/en-us/windows/wsl/install) or something like Kali Linux in a VM (www.kali.org/get-kali/)\nNote that if you plan to actually do CTF’s after CodeMash, the VM is a better option and Kali is useful in other ways.\ndotpeek: (www.jetbrains.com/decompiler/download/#section=web-installer)\n        Windows: dotPeek64.2023.3.1.exe\n        Mac: dotpeek is Windows only. If you need cross platform alternatives - please contact the speaker in the CodeMash Discord!\nIlSpy worked out well for me, using a mac\nGhidra: (ghidra-sre.org/)\nInstallation Notes: (htmlpreview.github.io/://github.com/NationalSecurityAgency/ghidra/blob/Ghidra_10.4_build/GhidraDocs/InstallationGuide.html#Requirements)\n        Windows and Mac: ghidra_10.4_PUBLIC_20230928.zip\n        Linux: ghidra-Ghidra_10.4_build.tar.gz\nctfd.kd8bfn.org/challenges"},"conferences/2024/2024-Codemash/Building-Applications-on-Top-of-Large-Language-Models-(LLMs)-(Part-1)":{"slug":"conferences/2024/2024-Codemash/Building-Applications-on-Top-of-Large-Language-Models-(LLMs)-(Part-1)","filePath":"conferences/2024/2024 Codemash/Building Applications on Top of Large Language Models (LLMs) (Part 1).md","title":"Building Applications on Top of Large Language Models (LLMs) (Part 1)","links":["conferences/2024/2024-Codemash/2024-CodeMash"],"tags":[],"content":"… Back to 2024 CodeMash …\ncodemash.org/session-details/\nBuilding Applications on Top of Large Language Models (LLMs) (Part 1)\nPresented by: Nilanjan Raychaudhuri, BJ Allmon\nTime: Tuesday, Jan. 09, 8:00 AM - 12:00 PM\nIt’s no secret that a new generation of powerful and highly-scaled language models is taking the world by storm. Large language models are becoming a powerful new primitive for building software.\nIn this precompiler, we will deep dive into the rapidly evolving landscape of Large Language Models (LLMs) &amp; how software developers can leverage the untapped potential of LLMs. The hands-on exercises will give the audience a first-hand experience building applications on top of LLMs. Using Python, OpenAI, Langchain, and vector databases, developers will learn how to build intuitive conversational interfaces for their applications, making them more engaging and user-friendly.\nRoom: Indigo BayTags: Python, Programming Principles, Machine LearningLevel: Intermediate\n\nREQUIREMENTS\nModern &amp; powerful Laptop\nPython: (www.python.org/)\n        Windows: python-3.12.1-amd64.exe\n        Mac: python-3.12.1-macos11.pkg\n        Linux: Python-3.12.1.tar.xz\nOpenAI API key (openai.com/blog/openai-api)\nRepo cloned and dependencies are installed: (github.com/Tublian/langchain-rag-template)"},"conferences/2024/2024-Codemash/Dev-containers--What-are-they-and-why-do-you-need-them":{"slug":"conferences/2024/2024-Codemash/Dev-containers--What-are-they-and-why-do-you-need-them","filePath":"conferences/2024/2024 Codemash/Dev containers- What are they and why do you need them.md","title":"Dev containers- What are they and why do you need them","links":["conferences/2024/2024-Codemash/2024-CodeMash"],"tags":[],"content":"… Back to 2024 CodeMash …\nDev containers are also known as remote containers or developer containers. The term “Dev containers” was coined by Microsoft, while the term “remote containers” was used earlier.\nDev containers are used to create a consistent development environment that is isolated from the host machine. This can be useful for a variety of reasons, such as:\n\nEnsuring that developers have the same development environment, regardless of their operating system or hardware configuration. This can help to prevent bugs and other issues that can arise when developers are working on different systems.\nReducing the risk of security breaches by isolating the development environment from the host machine. This is especially important if developers are working on sensitive data or code.\nSpeeding up development by providing a pre-configured environment that developers can use without having to install and configure software and dependencies.\n\nTo use Dev Containers in Visual Studio Code, you can follow these steps:\n\nOpen Visual Studio Code.\nClick on the “Extensions” icon in the left sidebar.\nSearch for “Dev Containers” and install the extension.\nOnce the extension is installed, you will see a new “Dev Containers” icon in the Activity Bar (cmd + shift + p)\nExplore some of the options available here.\n\nYou can now use the Dev Container to develop your code. The Dev Container will be isolated from your host machine, so you can be sure that your development environment is consistent and secure.\nThe rest of the presentation was a live demonstration of how to use a dev container."},"conferences/2024/2024-Codemash/Isn't-it-time-to-ditch-code-coverage--Focus-on-high-value-tests-instead":{"slug":"conferences/2024/2024-Codemash/Isn't-it-time-to-ditch-code-coverage--Focus-on-high-value-tests-instead","filePath":"conferences/2024/2024 Codemash/Isn't it time to ditch code coverage- Focus on high value tests instead.md","title":"Isn't it time to ditch code coverage- Focus on high value tests instead","links":["conferences/2024/2024-Codemash/2024-CodeMash"],"tags":[],"content":"… Back to 2024 CodeMash …\nDuring this session, the speaker covered the idea that code coverage is not a reliable measure of quality and that focusing on it can lead to a culture of quantity over quality.\n\nHe argues that code coverage is often used as a proxy for quality, but it does not actually measure the correctness or robustness of the code.\nHe also points out that code coverage can be gamed, which means that developers can write code that satisfies the coverage requirements without actually improving the quality of the code.\nInstead of focusing on code coverage, the speaker encourages developers to focus on writing high-quality code that meets the needs of the users.\n\nThere are three main challenges that prevent building a culture of quality in engineering teams:\n\nThe belief that quality is subjective. Some people believe that quality is in the eye of the beholder and that there is no objective way to measure it. This can lead to a lack of focus on quality and make it difficult to hold engineers accountable for their work.\nThe lack of a shared understanding of quality. If engineers don’t have a shared understanding of what quality means, they will not be able to work together to produce high-quality products. It is important to define quality clearly and consistently so that everyone is on the same page.\nThe pressure to ship quickly. In today’s fast-paced tech industry, there is often pressure to ship products quickly, even if they are not fully complete. This can lead to cutting corners and sacrificing quality. It is important to find a balance between speed and quality so that products can be released on time without sacrificing their integrity.\n\nBuilding a culture of quality in software engineering is challenging but crucial, and everyone in the team has a role to play in achieving it.\n\nChanging a culture is difficult, but it is essential to foster a culture of quality where individuals hold each other accountable and focus on high-value testing.\nObjective metrics like code coverage may not effectively measure quality and may lead to unproductive efforts to meet targets.\nInfluential individuals, including individual contributors, can drive cultural change by promoting values and behaviors that prioritize quality.\nOvercoming challenges such as tech debt, documentation burden, prolonged projects, and decision-making paralysis is necessary to build a high-performing team.\nEncouraging a culture of quality leads to happier engineers and a more productive work environment.\n\nIndividual contributors play a significant role in shaping culture. WE are the ones who are actually doing the work and interacting with each other on a daily basis, so we have a lot of influence over the norms and values that develop in the workplace. If individual contributors are committed to quality and hold each other accountable, they can create a culture of excellence."},"conferences/2024/2024-Codemash/Java-Anti-Patterns":{"slug":"conferences/2024/2024-Codemash/Java-Anti-Patterns","filePath":"conferences/2024/2024 Codemash/Java Anti Patterns.md","title":"Java Anti Patterns","links":["conferences/2024/2024-Codemash/2024-CodeMash"],"tags":[],"content":"… Back to 2024 CodeMash …\n\n\n\n\n\n\n\n\n\n"},"conferences/2024/2024-Codemash/Mad-Scientist-Lab-With-Raspberry-Pi-Pico-Microcontrollers":{"slug":"conferences/2024/2024-Codemash/Mad-Scientist-Lab-With-Raspberry-Pi-Pico-Microcontrollers","filePath":"conferences/2024/2024 Codemash/Mad Scientist Lab With Raspberry Pi Pico Microcontrollers.md","title":"Mad Scientist Lab With Raspberry Pi Pico Microcontrollers","links":["conferences/2024/2024-Codemash/2024-CodeMash"],"tags":[],"content":"… Back to 2024 CodeMash …\nMad Scientist Lab With Raspberry Pi Pico Microcontrollers\ncodemash.org/session-details/\nPresented by: Barry Tarlton, Brendan Barth\nTime: Wednesday, Jan. 10, 8:00 AM - 12:00 PM\nCarefully plugging the wires into the bread board, doubt seeps in, “should the red wire go to ground or the white one?” LEDs all in place, Python code properly indented (spaces, not tabs), prayers go up for the magic smoke to not escape as the electronics are powered on. In an instant, worries subside as the microcontroller springs to life and the twinkling of little lights glowing in the precise rhythm as instructed by your code testifies that software and hardware are in perfect harmony.\nAmazing experiences like this and more can be yours in this session. You’ll get to create your own awesome game with sharks and lasers using the Raspberry Pi Pico microcontroller and a variety of other electrical components. Learn to merge electronics and software in beautiful harmony. The Pi Pico is an inexpensive microcontroller that can run MicroPython to control a plethora of electrical doodads. If you want to bring your code into the real world with crazy inventions, come to this session to get the foundational skills you need to release your inner mad scientist!\nRoom: NileTags: Python, Hardware, IoTLevel: Intermediate\n\nBasically you just need the simple Python editor called Thonny which allows you write code on your laptop and execute it on the Pico via a USB cable. USB cables will be provided just make sure you have a laptop with Thonny installed and an available USB jack on your laptop. We will have a few USB C to USB A adapters for those with only tiny ports. We will not have Mac dongles so make sure you have a way to connect a USB A cable into your laptop.\nPlease download and install the latest version(4.x or higher) of Thonny. (thonny.org/)\n        Windows 64 bit: thonny-4.1.4-windows-portable.zip\n        Windows 32 bit: thonny-py38-4.1.4-windows-portable.zip\n        Mac: thonny-4.1.4.pkg\n        Linux instructions can be found at the above link."},"conferences/2024/2024-Codemash/Managing-a-Rewrite-Without-Getting-Stuck-in-the-Tar-Pit":{"slug":"conferences/2024/2024-Codemash/Managing-a-Rewrite-Without-Getting-Stuck-in-the-Tar-Pit","filePath":"conferences/2024/2024 Codemash/Managing a Rewrite Without Getting Stuck in the Tar Pit.md","title":"Managing a Rewrite Without Getting Stuck in the Tar Pit","links":["conferences/2024/2024-Codemash/2024-CodeMash"],"tags":[],"content":"… Back to 2024 CodeMash …\nThe four tar pits are:\n\nThe Tech Debt Tar Pit: This is when engineers spend a lot of time fixing problems in old, poorly configured systems.\nThe Documentation Tar Pit: This is when engineers spend a lot of time writing documentation that no one reads.\nThe Forever Project Tar Pit: This is when a rewrite project drags on for months or years, never getting finished.\nThe Analysis Paralysis Tar Pit: This is when engineers get stuck making a decision because they are afraid of making the wrong choice.\n\n\nThe first tar pit is technical debt\n\nTechnical debt is the accumulated cost of not fixing problems in a codebase as they arise.\nIt can make it difficult and expensive to rewrite a system.\nIt can also lead to bugs, security vulnerabilities, and performance problems.\nTo avoid technical debt, it’s important to have a plan for addressing it as part of the rewrite. This may involve refactoring the existing code, rewriting parts of the code from scratch, or using a different programming language.\n\nThe second tar pit is the big bang rewrite.\n\nThe big bang rewrite is an attempt to rewrite an entire system from scratch all at once.\nThis is often done in an attempt to address a large number of problems all at once.\nHowever, the big bang rewrite is often unsuccessful because it is difficult to manage and can introduce new problems.\nA better approach is to break the rewrite down into smaller, more manageable chunks.\n\nThe third tar pit is the forever project.\n\nThe forever project is a never-ending project that never seems to get completed.\nThis is often due to a lack of clear goals or objectives, or because the project is constantly changing.\nForever projects can be very demotivating and can lead to burnout.\nTo avoid the forever project, it is important to have clear goals and objectives, and to break the project down into smaller, more manageable tasks.\n\nThe fourth tar pit is analysis paralysis.\n\nAnalysis paralysis is the inability to make a decision due to overthinking the options.\nThis can be caused by a fear of making the wrong decision, or by a lack of information.\nAnalysis paralysis can lead to missed opportunities and wasted time.\nTo avoid analysis paralysis, it is important to set a deadline for making a decision, and to gather as much information as possible before making the decision.\n"},"conferences/2024/2024-Codemash/Out-of-Control--How-to-rescue-a-struggling-software-project":{"slug":"conferences/2024/2024-Codemash/Out-of-Control--How-to-rescue-a-struggling-software-project","filePath":"conferences/2024/2024 Codemash/Out of Control- How to rescue a struggling software project.md","title":"Out of Control- How to rescue a struggling software project","links":["conferences/2024/2024-Codemash/2024-CodeMash","conferences/2024/2024-Codemash/Rescuing-Project-Codemash-2024.pptx"],"tags":[],"content":"… Back to 2024 CodeMash …\nTransclude of Rescuing-Project-Codemash-2024.pptx\nTo rescue a failing project, follow these 15 principles:\n\n\nPrinciple 1: Automate all checks:\n\nAutomate formatting, linting, tests, and error handling to improve code quality and consistency.\n\n\n\nPrinciple 2: Use checklists for non-automatable aspects:\n\nCreate checklists for code reviews, documentation, accessibility, and security to ensure quality.\n\n\n\nPrinciple 3: Document decisions and code:\n\nDocument project decisions, code architecture, and the “why” behind code comments to improve collaboration and understanding.\n\n\n\nPrinciple 4: Colocate related code:\n\nOrganize code logically and group related code together to improve maintainability and readability.\n\n\n\nPrinciple 5: Mark and centralize legacy code:\n\nDeprecate and centralize legacy code to prevent its use and maintain a consistent codebase.\n\n\n\nPrinciple 6: Assign one person responsible for quality:\n\nMake one person responsible for code quality to ensure standards are met and technical debt is managed.\n\n\n\nPrinciple 7: Run code in reviews:\n\nPair program and run code during reviews to identify issues and improve collaboration.\n\n\n\nPrinciple 8: Validate at runtime:\n\nUse runtime validation with tools like Zod to ensure data integrity and prevent errors.\n\n\n\nPrinciple 9: Minimize environments:\n\nReduce environment proliferation and only maintain necessary environments.\n\n\n\nPrinciple 10: Align repos with the project goal:\n\nGroup related repos together and eliminate silos to improve collaboration and streamline development.\n\n\n\nPrinciple 11: Streamline DX and tests with mocks:\n\nConsider using mock service workers and custom development tools to improve developer experience and testing efficiency.\n\n\n\nPrinciple 12: Foster true collaboration:\n\nBreak down team silos, encourage daily standups, and unify teams to improve collaboration and communication.\n\n\n\nPrinciple 13: Monitor errors:\n\nImplement error tracking tools to identify, reproduce, and resolve errors quickly.\n\n\n\nPrinciple 14: Create and utilize a design system:\n\nEstablish a design system to ensure consistent user experience, reusable components, and improved development efficiency.\n\n\n\nPrinciple 15: Document your reuse strategy:\n\nDocument how you reuse code, including unit tests, discoverability, shared locations, and Storybook documentation.\n\n\n"},"conferences/2024/2024-Codemash/Platform-as-a-Product--The-future-of-Agile-and-DevOps":{"slug":"conferences/2024/2024-Codemash/Platform-as-a-Product--The-future-of-Agile-and-DevOps","filePath":"conferences/2024/2024 Codemash/Platform as a Product- The future of Agile and DevOps.md","title":"Platform as a Product- The future of Agile and DevOps","links":["conferences/2024/2024-Codemash/2024-CodeMash"],"tags":[],"content":"… Back to 2024 CodeMash …\n\nPlatforms as a product allow organizations to increase efficiency and reduce costs by consolidating resources and creating self-service tools.\nContext switching and cognitive load are major impediments to productivity.\nContext switching is the act of changing from one task to another. It can be a major impediment to productivity in DevOps because it takes time and effort to refocus our attention and remember the details of the new task. When we context switch frequently, we make more mistakes and take longer to complete tasks.\nDevOps teams often need to context switch frequently between different tasks, such as writing code, testing code, deploying code, and monitoring systems. This can be very taxing on our cognitive abilities and lead to burnout.\nTo reduce context switching, DevOps teams should try to group similar tasks together and minimize the number of times they switch between different tasks. They can also use tools and techniques to help them stay organized and focused, such as task lists, project management software, and mind maps.\nPlatform teams can help to reduce context switching and cognitive load by providing self-service tools and resources.\nAutomation around self-service tools and resources can help to improve the efficiency and productivity of DevOps teams. By automating tasks that are repetitive and time-consuming, teams can free up their time to focus on more strategic initiatives. Additionally, automation can help to reduce the risk of human error.\nSome of the benefits of automating self-service tools and resources include:\n\nImproved efficiency: Automation can help to reduce the amount of time that teams spend on repetitive tasks, such as provisioning infrastructure, deploying applications, and managing configurations.\nIncreased productivity: By freeing up time to focus on more strategic initiatives, automation can help teams to be more productive.\nReduced risk of human error: Automation can help to reduce the risk of human error by automating tasks that are prone to error.\nImproved compliance: Automation can help teams to comply with regulations and standards by automating tasks that are required by these regulations and standards.\n\nHere are some specific examples of how automation can be used to improve self-service tools and resources for DevOps teams:\n\nProvisioning infrastructure: Automation can be used to provision infrastructure, such as servers, networks, and storage, in a repeatable and consistent manner. This can help to ensure that infrastructure is provisioned in a secure and compliant manner.\nDeploying applications: Automation can be used to deploy applications to infrastructure. This can help to reduce the time and effort required to deploy applications, and it can also help to ensure that applications are deployed in a consistent manner.\nManaging configurations: Automation can be used to manage configurations of applications and infrastructure. This can help to ensure that configurations are consistent across environments and that changes to configurations are tracked and managed.\n\nIt is important to note that automation is not a silver bullet. It is important to carefully consider the specific needs of your organization and to implement automation in a way that is consistent with your existing processes and procedures.\nPlatform teams can also help to improve security, compliance, and governance.\nPlatform teams are cross-functional teams that own and manage the shared infrastructure, tools, and services that are used by multiple teams within an organization. They are responsible for ensuring that these shared resources are reliable, secure, and scalable, and that they meet the needs of the teams that use them.\nSome of the benefits of platform teams include:\n\nReduced duplication of effort: By centralizing the management of shared infrastructure, tools, and services, platform teams can help to reduce the duplication of effort across teams.\nImproved efficiency: Platform teams can help to improve efficiency by providing a single point of contact for teams that need to access shared resources.\nIncreased agility: Platform teams can help to increase agility by enabling teams to quickly and easily provision new resources as needed.\nImproved security: Platform teams can help to improve security by implementing security best practices and by monitoring the use of shared resources.\nImproved compliance: Platform teams can help to improve compliance by ensuring that shared resources are compliant with relevant regulations and standards.\nEnhanced governance: Platform teams can help to enhance governance by providing a central repository of information about shared resources and by tracking changes to these resources.\n\nPlatform teams can be difficult to implement, but the benefits can be significant.\nPlatform teams are often seen as a way to improve the efficiency and effectiveness of stream teams. By centralizing the management of shared infrastructure, tools, and services, platform teams can help to reduce the duplication of effort and improve collaboration between teams.\nSome of the benefits of platform teams include:\n\nReduced duplication of effort: By centralizing the management of shared infrastructure, tools, and services, platform teams can help to reduce the duplication of effort across teams.\nImproved efficiency: Platform teams can help to improve efficiency by providing a single point of contact for teams that need to access shared resources.\nIncreased agility: Platform teams can help to increase agility by enabling teams to quickly and easily provision new resources as needed.\nImproved security: Platform teams can help to improve security by implementing security best practices and by monitoring the use of shared resources.\nImproved compliance: Platform teams can help to improve compliance by ensuring that shared resources are compliant with relevant regulations and standards.\nEnhanced governance: Platform teams can help to enhance governance by providing a central repository of information about shared resources and by tracking changes to these resources.\n\nThe decision of whether or not to create a platform team is ultimately a decision that should be made based on the specific needs of the organization. However, for organizations that are looking to improve the efficiency and effectiveness of their development teams, platform teams can be a valuable asset."},"conferences/2024/2024-Codemash/Thinking-Architecturally":{"slug":"conferences/2024/2024-Codemash/Thinking-Architecturally","filePath":"conferences/2024/2024 Codemash/Thinking Architecturally.md","title":"Thinking Architecturally","links":["conferences/2024/2024-Codemash/2024-CodeMash","conferences/2024/2024-Codemash/Thinking-Architecturally","MY_NOTES-from-Thinking-Architecturally"],"tags":[],"content":"… Back to 2024 CodeMash …\nThinking Architecturally\nThinking Architecturally\ncodemash.org/session-details/\nPresented by: Nathaniel Schutta\nTime: Wednesday, Jan. 10, 1:00 PM - 5:00 PM\nRich Hickey once said programmers know the benefits of everything and the trade offs of nothing…an approach that can lead a project down a path of frustrated developers and unhappy customers. As architects though, we must consider the trade offs of every new library, language, pattern or approach and quickly make decisions often with incomplete information. How should we think about the inevitable technology choices we have to make on a project? How do we balance competing agendas? How do we keep our team happy and excited without chasing every new thing that someone finds on the inner webs?\nAs architects it is our responsibility to effectively guide our teams on the technology journey. In this talk I will outline the importance of trade offs, how we can analyze new technologies and how we can effectively capture the inevitable architectural decisions we will make. I will also explore the value of fitness functions as a way of ensuring the decisions we make are actually reflected in the code base.\nRoom: NileTags: Career Development, Soft Skills, ArchitectureLevel: Intermediate\n\nI attended this as a 4 hr workshop session, the following are my notes from this session, from my perspective.\n\nRecording of his talk from different conference in shorter-from:\nwww.youtube.com/watch\nHis written abstract:\nntschutta.io/abstracts/thinking/\n\nMY_NOTES from Thinking Architecturally\nMY SUMMARY:\nAs DevOps engineers, we are often at the forefront of designing and maintaining complex software systems. Our decisions have a profound impact on the system’s performance, reliability, and maintainability. To ensure we make well-informed decisions, we must adopt a structured approach that emphasizes documentation and continuous evaluation.  There’s a lot that we can learn from an architectural viewpoint, so here’s some of my biggest takeaways:\nThe Power of Architectural Decision Records (ADRs)\nADRs provide a systematic way to capture the rationale behind our architectural choices. They serve as a valuable communication tool, enabling team members to understand the “why” behind our decisions, not just the “what.” With ADRs, we can:\n\nFacilitate effective knowledge transfer, ensuring that new team members can quickly grasp the architectural landscape.\nEstablish consistency in our decision-making process, promoting a shared understanding of the system’s evolution.\nCreate a historical record of architectural decisions, enabling us to revisit and learn from past experiences.\n\nAn example ADR could look like this:\n- It does not need to be complicated\n- ADR: Lightweight atchitecurtew decision records\n- title/ID (immutable)\n- sequential order. 3-ish digit number should be suficient\n- This can be helpful to eliminate tribal knowledge and establish context rapidly.\n- Status - proposed, accepted, deprecated, superceded\n- What is the problem - do not skimp on this! Give couple paragraphs or even pages!\n- Give assumptions and constraints\n- What are the options - \n- list pros and cons\n- Which did you choose?\n- Explain why?\n\t- Also explain why not --- we eliminated this other reason because xyz.\n- Consequences of the decision (both positive and negative)\n\n\nSome other information about using ADRs:\n\nIf you do not fill this out, someone else will come up with a story and it could be drama.. Show your work!\nAlso, you gain credibility if you go thru this process.\nThis is also being done for people who are coming after you…(CYA)\n\nPlease remember that you will be the person who comes after you at some point.. You will always wonder “which idiot wrote this?!” but eventually it will dawn on you that YOU were that idiot.\n\n\nConsider a “time capsule” of what did you do and why. Even a short and sweet screencast can be good.\nPrevent Monday-morning-quarterbacking for “Why did we do this?” … “I’m sure we had a good reason, does anyone remember what that was?” “That’s not what I would have done” ⇐- you will now have reasons if you fill out all of the above.\nDo periodic reviews (especially with teams that have new members) because it can bring valued info to the table.\nStore in version control! Old versions WILL stick around.  Make sure that things are documented and stored and updated.  This is not the place for wiki or jira tickets! No one looks back at those things as regularly as they should… keeping it in version control with the repo will allow ease of use, access and maintainability.\n\nAlso don’t overcomplicate it! Does not need to be it’s own app…It does not need to be a website. It does not need to be a wiki. This should be short and sweet, always able to be updated when someone commits their code.  Simply use a bunch of files with a sequential order in your repo for best results.\n\n\n\nadr.github.io/\nBy embracing ADRs, we foster a culture of transparency and accountability, encouraging thoughtful decision-making and continuous improvement.  If you don’t do them right now, you can always start today. You don’t need to start with a new project to do something right.\nLeveraging Fitness Functions for Architectural Health\nQuality attributes are essential characteristics that measure the non-functional aspects of a software system, complementing the functional requirements. These attributes, often referred to as “-ilities”, encompass a wide range of aspects, including (but certainly not limited to) scalability, reliability, security, usability, and maintainability. By focusing on quality attributes, software architects and engineers can create systems that are not only functional but also resilient, adaptable, and user-friendly. Defining and prioritizing quality attributes early in the software development process helps ensure that the resulting system meets the needs of end-users and stakeholders.\nFitness functions are ways to achieve these quality attributes. They are essential tools for assessing the effectiveness of our architectural decisions. They provide quantifiable metrics that measure how well the system meets its intended quality attributes, such as performance, scalability, reliability, and maintainability. By continuously monitoring fitness functions, we can:\n\nIdentify areas where the architecture may be falling short, allowing us to take proactive steps to address potential issues.\nTrack the system’s progress over time, ensuring that it continues to meet our evolving requirements.\nMake data-driven decisions about architectural changes, optimizing the system’s overall health and performance.\n\nFitness functions empower us to make informed decisions, ensuring that our architectural choices align with the system’s desired outcomes and user expectations.\nTogether, ADRs and fitness functions form a powerful combination that enables us to create and maintain software systems that are resilient, adaptable, and responsive to changing needs. By embracing these practices, we can elevate our engineering capabilities and deliver exceptional solutions that can stand the test of time.\n\nMy scrambled notes:\nArchitectural katas\nfundamentalsofsoftwarearchitecture.com/katas/list.html\n“quality attributes” is a better way to call it “non-functional requirements”\nalso “cross functional requirements”\n\nmaintainability\nscalability\nreliability\nsecurity\ndeployability\nsimplicity important, often overlooked\n- “It takes a lot of intellectual horsepower to understand this codebase”\nwiki page with system quality attributes\n\n“It depends” ⇐ it’s a very subjective space. There’s no “best” in this space… we’re trying to do the “least worst” lol\nSecurity &amp; usability for the instance — seems to be on differing ends of the spectrum\nThe art of what we’re trying to do: It’s a balance.\nHow to get buy in for things that are simple &amp; maintainable?\nWe need to influence them to believe it’s their idea, lol\n\noutline the benefits. This is what YOU get out of this.\nFind common ground - we all agree this should suck less.\nAvoid aggression, don’t argue up the org chart\nListen.  Often times people just need to be heard\n\n“Is this something you want me to fix? Or is this something you want me to listen to?”\n\n\nIt does need to be a conversation - no matter how hard it is.\nIt is hard to convince people to do something\nFind the influencers.. influence the influencer. Bounce ideas across to them first. Get them to be the champions of things you want to persuade for\nApproach as an equal..  Rely on the strength of your ideas and your reputation\n\nYour reputation speaks for you when you are not in the room\n\nIf you don’t know what your reputation is, ASK\nYou may not like the answer, but it gives you the opprotunity to change it.\n\n\n\n\nFind common ground.\nReciprocity rules. I’ll help you, you help me.\nBe respectful\nResearch your ideas - use trusted sources.\n\nIf it resonates in your org, use it\n\n\nRecruit allies, nothing wrong with bringing help\nSpeak their language… technobabble might be too much for them.\nWhat resonates?\n\nCost? speed? etc?\n\n\nShape your statement accordingly.\n\nWhen you are looking at requirements/specs lists, look for words that stand out to you.\n- “demand is extremely high”\n- “millions of cars”\n- “available 24x7”\n- “owner to check the stats” ⇐ who is owner?\n- “must be secure” ⇐ what is secure?\n- “owner to summon the car” ⇐ location data.\n- “generates a lot of information that can be mined” ⇐ how much? What kind of data\n- “only authorized users” ⇐ who? How can you tell?\n- “audit access” ⇐\n\nFind words that equate to risk!!\nAuditability! Availability! Security! Usability!\nHow would you rank them?\n\nRank quality attribute from high/low to importance.\nThis ranking might be different as compared to other groups (security team vs customer vs maintainer)\n\n\nThe value of this is the DISCUSSION that happens… Getting feedback — agree/disagree, etc\n\n\nGroup project:\nConference organizer needs a management system for the conferences he runs for both speakers and attendees\n\n\nUsers: hundreds of speakers, dozens of event staff, thousands of attendees\n\n\nRequirements:\n\n\nattendees can access speaking schedule online, including room assignments\n\n\nspeakers can manage talks (enter, edit, modify)\n\n\nattendees ‘vote up/down’ talks\n\n\norganizer can notify attendees of schedule changes up-to-the-minute (if attendees opt in)\n\n\neach conference (being a different subject) can be branded independently\n\n\nspeaker slides are accessible online only to attendees\n\n\nevaluation system via web page, email, SMS, or phone\n\n\nAdditional Context:\n\n\nConference runs across the US.\n\n\nVery small support staff.\n\n\n‘Bursty’ traffic: extremely busy when conference is occurring.\n\n\nConference organizer wants to easily ‘skin’ the site for different technology offerings.\n\n\nSpeakers\n\nreliability\nusability\nsimplicity\nmaintainability\n\nStaff\n\nscalability\nreliability\nsecurity\nmaintainability\n\nAttendees\n\nUsability\nSimplicity\nAvailability\nAccessibility\n\n\n\n\nYou cannot be in all places at all times. Establish principles.\n\n\nLol no one ever says “all the architects are sipping espresso and drawing on the walls”\n\n\nYou cannot be involved with every decision.\n\n\nYou do need to establish guide rails and north stars.\n\n\nCreate an environment within which our projects can survive.\n\n\nHow do you know if projects are following the principals we laid out?\n\nShortening the feedback loops.\nFitness functions!!\n\nWe’re familiar with the second law of thermodynamics\nThe universe WANTS to be disordered.\nSoftware is not immune to this..lol\n\n\nYou go thru all the work to make this work, but how do you maintain it?\nYou can’t be there every minute.\nDecisions we thought we got right the first time — or, we wish we did.\nWe could change our assumptions…We could design architeture knowing things could be changed\n\nBOOK: Building Evolutionary …? Architecutre? oreiley book\n\n\nUse toggles for releases.\nUse hypothesis driven development\nTest this stuff.\n\n\n\nFitness functions:\nA to do list for developers from architects\n- Lightweight, low ceremony, governance\n\nThis will shorten the feedback loop.\nSeemingly better than CAB meetings/approvals where pepople in the RACI chart don’t reall yknow whats going on\n\n\n\nThis comes from mutational computing.. it’s about balancing tradeoffs to capture and preserve architectual success.\n\n\nService Level Indicators. (This can be measurable, it must be useful)\n\nBUT Just because you can measure it doesn’t mean that it matters!\n\n\n\nOnce you have metrics, you have goals SLO - Service Level Objectives\n\nNot the same as SLA — A = aggrement, which is a contract.\n\n\n\nAnyhow, back to Fitness Fucntions..\n\nAre we closer to or further from goal?\nCan this test be automated? ⇐ ideal, put it in the pipeline if possible.\n\nEvery service call  must respond within 100ms\nCyclomatic complexity shall not exceed X\nNo cyclical depenancies\nDirectional depenancies\nConsumer driven contracts\n\n(Spring Cloud Contracts as an example)\n\n\nAverage &amp; maximum response time\nScalabilty - average response times\nNumber of timeouts\ndocumentation exists\nrunbooks\non call list\nNearing the next price tier with cloud provider\n\nYou should have a price ceiling on things, lol\n\n\nAlert when things go out of band\nChaos engineering is important!\nWhat is the ceiling for this service (during testing &amp;&amp; during regular hrs)\nHow many clicks should the user have for normal use actions\nHeat maps during UAT (eyes or clicks)\n\n\n\n\n\nThe beauty of low-fidelity prototypes (paper/pencil) is that people will give you feedback that they normally would not.  If it looks too close to real, people will just expect it to work a certain way &amp; ship it right away… You can also give them a good idea for user’s mental model too.\n\n\n\nwww.thoughtworks.com/en-us/insights/articles/fitness-function-driven-development\n\nGet a good understanding of what is normal, a warning light, or shitstorm alert.\n\n\nFitness functions help us know what is important to our architecute.  It also helps us come to compromises too.\n\n\nholistic vs atomic\n\n\nWe can’t test every possible combination.\n\n\nWe need to be selective\n\n\nTriggered or continual\n\nWhat is the frequency of testing.. happening all the time or just during code checkin\n\n\n\nAnything we base on a metric can be pass fail\n\n\nrange of things that acceptable outcomes.\n\n\nAutomated vs manual\n\nAutomated is good.. We cannot rely on the rubegolberg machines of the past\nIdeally most of our fitness functions should be in our pipelines.\nExisting projects may not be able to get to this.\nTemporal fitness functions\n\nA reminder that can be put into code\n\nOn march 1st, fail, and check versions\nBreak upon upgrade tests\n\n\n\n\nIdentify as many of these as early as possible.\n\nHelps to prioritize features.\n\n\nThing will evolve, we will learn better ways to do things.\nClassify fitness functions.\n\nKey: Critical to decisions\nRelevant: Considered but unlikely to influence the archicture\nNot relevant: Will not impact our decisions\n\nThese short circuit discussions.\n\n\n\n\nKeep fitness functions visible.\n\nPut on a web page.\nReview periodicaly\nCheck if new things to track\nNew way to measure//test for these things\nUpdate annually at minimum\n\n\n\n\n\nDocument your architecutral decisions!\n\nIt does not need to be complicated\nADR: Lightweight atchitecurtew decision records\n\ntitle/ID (immutable)\nsequential order. 3-ish digit number should be suficient\nThis can be helpful to eliminate tribal knowledge and establish context rapidly.\nStatus - proposed, accepted, deprecated, superceded\nWhat is the problem - do not skimp on this! Give couple paragraphs or even pages!\nGive assumptions and constraints\nWhat are the options -\nlist pros and cons\nWhich did you choose?\nExplain why?\n\nAlso explain why not --- we eliminated this other reason because xyz.\n\n\nConsequences of the decision (both positive and negative)\n\n\nIf you do not fill this out, someone else will come up with a story and it could be drama.. Show your work!\nAlso, you gain credibility if you go thru this process and\nThis is also being done for people who are coming after you.\n\nYou will be the person who comes after you at some point. lol. You will always wonder “which idiot wrote this?!” but it dawns on you that YOU were that idiot\n\n\nConsider a “time capsule” of what did you do and why. Even a screencast can be good.\nPrevent monday morning quarterbacking for “Why did we do this?”  “We had a good reason, does anyone remember what that was?” “That’s not what I would have done” ⇐- you will now have reasons if you fill out all of the above.\nStore in version control! Old versions WILL stick around.  Make sure that things are documented and stored and updated\nPeriodic reviews (especially with teams that have new members) can bring valued info to the table\nDo not put ADRs in Jira — put this in version control.  But also don’t overcomplicate it! Does not need to be it’s own app… a bunch of files with a sequential order can be helpful for it.\n\n\n\nadr.github.io/\nYou can start getting better on Monday when you go back to work. You don’t need to start with a new project.\n\n\nJust because you didn’t start with good decisions does not mean you need to give up on the project.\nYou could potentially do a retrospective ADR to pull out that info… You may miss some points, but it can help to bring someone up to speed. BUT you can use the fuller method with any new steps that you take in the process."},"conferences/2024/2024-Codemash/Verbs,-not-nouns--Writing-documentation-users-want-to-read":{"slug":"conferences/2024/2024-Codemash/Verbs,-not-nouns--Writing-documentation-users-want-to-read","filePath":"conferences/2024/2024 Codemash/Verbs, not nouns- Writing documentation users want to read.md","title":"Verbs, not nouns- Writing documentation users want to read","links":["conferences/2024/2024-Codemash/2024-CodeMash"],"tags":[],"content":"… Back to 2024 CodeMash …\nPresentation used during this session: github.com/bmacdonald-editor/codemash2024/blob/main/Verbs%2C%20Not%20Nouns%20-%20Codemash%202024.pdf\nAnother version of this session in a conversational manner done via this podcast: www.emilyomier.com/podcast/verbs-not-nouns-writing-effective-documentation-with-brian-macdonald\n\nWriting documentation that users want to read is crucial for effective communication and user satisfaction. To achieve this, focus on using verbs, understanding the user’s perspective, and organizing content logically and concisely. By using verbs and active voice, you can make your documentation more engaging and easier to understand. Organizing your documentation around user tasks and goals, rather than abstract concepts, ensures that it is relevant and helpful to your users.\nReference documentation is comprehensive, focuses on the product, and is designed for quick retrieval, while tutorial documentation is not comprehensive, focuses on the user, and is read from beginning to end.\n\nReference documentation is for experienced users who need detailed information about a product or service.\nTutorial documentation is a step-by-step guide that helps users learn how to use a product or service.\n\nReference documentation includes:\n\nMan pages: These are short help pages that provide information about commands, system calls, and other programs.\nAPI references: These documents provide information about the functions, classes, and other objects that make up an API.\nCode comments: These are annotations in code that explain what the code does.\nReadme files: These files provide an overview of a project, including information about how to install and use it.\n\nTutorial documentation includes:\n\nTutorials: Step-by-step guides that teach users how to perform a specific task or series of tasks.\nHow-tos: Similar to tutorials, but typically focused on a single, specific task.\nWalkthroughs: Guided tours of a product or service, often with screenshots or other visual aids.\nUse cases: Real-world examples of how a product or service can be used to solve a specific problem or achieve a desired outcome.\n\nWrite documentation that users actually want to read by focusing on verbs, understanding the user’s perspective, and organizing content in a logical and concise manner.\n\nUse verbs to convey actions and make your documentation more engaging.\nOrganize your documentation around user tasks and goals, rather than abstract concepts.\nWrite in a clear and concise style, using active voice and avoiding sales jargon.\nUse headings, subheadings, and bullet points to make your documentation easy to skim and understand.\nProvide specific examples and instructions to help users complete their tasks.\nTest your documentation with users to ensure that it is clear and helpful.\nUse a confident casual tone and address the reader directly.\nUse visuals to make your documentation more engaging.\n**Keep your documentation up-to-date and make it easy for users to find.\n"},"conferences/2024/2024-Codemash/Writing-Secure-APIs---A-Look-at-the-OWASP-2023-API-Top-10-List":{"slug":"conferences/2024/2024-Codemash/Writing-Secure-APIs---A-Look-at-the-OWASP-2023-API-Top-10-List","filePath":"conferences/2024/2024 Codemash/Writing Secure APIs - A Look at the OWASP 2023 API Top 10 List.md","title":"Writing Secure APIs - A Look at the OWASP 2023 API Top 10 List","links":["conferences/2024/2024-Codemash/2024-CodeMash"],"tags":[],"content":"… Back to 2024 CodeMash …\nowasp.org/API-Security/editions/2023/en/0x11-t10/\nSecurity awareness around APIs and the top 10 API vulnerabilities are discussed to provide guidance for developers in securing APIs.\n\nCommon API vulnerabilities include:\n\n\n\nInsecure authentication and authorization\nLack of proper input validation\nExcessive data exposure\nLack of rate limiting\nLack of proper encryption\nPoor logging and monitoring\nLack of API documentation and testing\n\n\n\nTo improve API security, developers should:\n\n\n\nUse strong authentication and authorization mechanisms\nValidate input data to prevent attacks such as SQL injection and cross-site scripting\nLimit data exposure by only returning necessary data\nImplement rate limiting to prevent brute-force attacks\nEncrypt sensitive data in transit and at rest\nImplement proper logging and monitoring to detect and respond to security incidents\nProvide clear and comprehensive API documentation and testing to help developers use the API securely\n\n"},"conferences/2024/2024-GrrCon":{"slug":"conferences/2024/2024-GrrCon","filePath":"conferences/2024/2024 GrrCon.md","title":"2024 GrrCon","links":[],"tags":[],"content":"Sept 26-27 2024\nLol, another one that I have bad notes but some pics.\nI have a trend.\nAnyhow.. here ya go.\n\nOh and Sushi Yama is good if you’re ever in the Grand Rapids area\n\n"},"conferences/2025/2025-BSides-Detroit":{"slug":"conferences/2025/2025-BSides-Detroit","filePath":"conferences/2025/2025 BSides Detroit.md","title":"2025 BSides Detroit","links":[],"tags":[],"content":"So this was the first conference I ever talked at!\nI gave a talk about vibe coding and securing the inputs n outputs. I’m a devops engineer, so I took the position (naturally) that at the end of the day - it’s just code.. and we can support and secure it when it hits our pipelines.\nI managed to record the audio of it, so watch it with the slides here!\n"},"index":{"slug":"index","filePath":"index.md","title":"The Tech Scratchpad","links":[],"tags":[],"content":"This site is a digital garden, a pile of notes as my scratchpad for my thoughts on stuff n things.\nIt’s not a blog. It’s not chronological. Some things have been posted to a blog, but not all.\nYou’ll find a mix of content here, loosely organized into a few main folders. Pick a thing on the sidebar and explore.\nAlso, checkout my other gardens\nThanks for stopping by!"},"tutorials/2020-03-06-esp8266blink":{"slug":"tutorials/2020-03-06-esp8266blink","filePath":"tutorials/2020-03-06-esp8266blink.md","title":"Getting Started with ESP8266: Blink","links":[],"tags":["ESP8266-homeautomation-arduinoide"],"content":"There’s a lot of different resources out there in terms of how to get started with Arduinos, ESP8266, Home Automation, and more: but this data is rarely in one place. My goal with this series is to get up and running and using the ESP8266 for the first time. I will explore how to make connections to other web services and do a some home-automation in my own real-world exercises. Thanks for joining me!\nI am using the ESP8266 development board. I got this one on ebay, you can try searching terms like “ESP8266 Development Board” or “ESP8266 with USB”. They can cost anywhere from 5 to 12 USD.\n![Screenshot from 2020-03-03 21-51-04](../assets/Screenshot from 2020-03-03 21-51-04.png)\nStep 1: Install Arduino IDE\nI’m running Linux PopOS!, which is an Ubuntu-based Linux distro; your mileage may vary. Our first goal is to download the Arduino IDE. If you’re running a different OS, you may follow different steps to install.\nFor me, the first thing that I’m going to do is update the latest package lists. Open up the terminal and type:\nsudo apt-get update\n\nNext, let’s install Ubuntu Make. Ubuntu Make is a command-line tool that allows us to setup our development environment with ease. In the terminal, type:\nsudo apt-get install ubuntu-make\n\nNext, we’ll use Ubuntu Make to install the Arduino IDE software. Back in the terminal, type:\numake electronics arduino\n\nOnce that’s complete, log out and back into your computer (or just restart). We’re now ready to start!\nStep 2: Update Preferences in Arduino IDE\nNext, we will need to add in the Boards Manager. Open Arduino IDE and navigate to File &gt; Preferences.\nIn the empty space, add in Additional Boards Manager URLs: arduino.esp8266.com/stable/package_esp8266com_index.json\nNote: If you already have URLs here, you may separate them with commas.\n![Screenshot from 2020-03-03 21-30-15](../assets/Screenshot from 2020-03-03 21-30-15.png)\nStep 3: Add the Generic ESP8266 Module Package\nNow that the library is there, let’s add the ESP8266 package by navigating to Tools &gt; Board(xxx) &gt; Board Manager. Now search “esp8266”.\nI selected the latest version to install:\n![Screenshot from 2020-03-03 21-37-19](../assets/Screenshot from 2020-03-03 21-37-19.png)\nOnce installation is complete, click Tools &gt; Board(xxx) &gt; Generic ESP8266 Module to activate it.\n![Screenshot from 2020-03-03 21-48-04](../assets/Screenshot from 2020-03-03 21-48-04.png)\nStep 4: Plug it in &amp; Identify the Port\nNext, plug in the module via USB.\nWe need to find out which port the module is plugged into. Open the terminal once more, and type\ndmesg\n\nWe’ll see a stream of some of the most recent things that have happened on your system: and if the last thing you did was plug in the ESP8266 module, you’ll see that at the very end.\n![Screenshot from 2020-03-03 22-05-38](../assets/Screenshot from 2020-03-03 22-05-38.png)\nIn my case, the module is\nttyUSB0\n\nGo back into the Arduino IDE and click Tools &gt; Port and select the module that you identified in dmesg.\n![Screenshot from 2020-03-03 22-10-02](../assets/Screenshot from 2020-03-03 22-10-02.png)\nStep 5: Grant Access\nIf you’re like me, I had to do one additional step to grant perms to edit anything at that port.\nBack in the terminal, type:\nsudo chmod a+rw /dev/ttyUSB0\n\nThis is granting Read &amp; Write access to “all” users.\nI found that I had to provide perms every time I disconnected/reconnected it.\nStep 6: Upload Sketch\nHere’s our sketch code:\n/*\nESP8266 Blink\nBlink the blue LED on the ESP8266 module\n*/\n \n#define LED 2 //Define blinking LED pin\n \nvoid setup() {\n  pinMode(LED, OUTPUT); // Initialize the LED pin as an output\n}\n// the loop function runs over and over again forever\nvoid loop() {\n  digitalWrite(LED, LOW); // Turn the LED on (Note that LOW is the voltage level)\n  delay(500); // Wait for a second\n  digitalWrite(LED, HIGH); // Turn the LED off by making the voltage HIGH\n  delay(500); // Wait for two seconds\n}\nNow we’re ready to click upload!\nUpon clicking Upload, I will get prompted to save my sketch - this is something that is saved locally for use later.\nAs it’s running, I will see the text “Uploading..”\n![Screenshot from 2020-03-03 22-19-34](../assets/Screenshot from 2020-03-03 22-19-34.png)\nSome useful text that might be of interest is how much memory that we’re using. This sketch appears to use 26% of program storage space.\nWhen it’s done, it will say “Done Uploading” and I will see my blinking LED!\n![Screenshot from 2020-03-03 22-19-52](../assets/Screenshot from 2020-03-03 22-19-52.png)\n"},"tutorials/2021-02-03-playyoutubefaster":{"slug":"tutorials/2021-02-03-playyoutubefaster","filePath":"tutorials/2021-02-03-playyoutubefaster.md","title":"Gotta Go Fast: Playing YouTube Videos Faster","links":[],"tags":["youtube-bookmarklet-chrome-javascript"],"content":"Do you enjoy consuming your media at 3x or 4x speed and you’re bummed that you can only speed up your YouTube videos up to 2x?\nMany people choose learning in an online, self-paced environment.  I find myself frequently diving into training at 2.5x or 3x speed — and I’ve found it dissapointing that YouTube tops out at only 2x speeds.\nThis Chrome Bookmarklet will help you speed up your YouTube video beyond the 2x speed limit!\nGotta Go Fast\nThis is a Bookmarklet for Chrome and may not be suitable in other browsers.  Your mileage may vary.\n\nRight click on the bookmark bar.\nClick “Add page…”\nName: “Play 3X Speed”\nIn the URL bar, paste this:\n\njavascript:(function(){document.getElementsByTagName(&quot;video&quot;)[0].playbackRate = 3})();\n\n\n\nClick Save.\nNext time you watch a youtube video, click this bookmark and it’ll speed up to 3X.\n\nIf you’d like a different variable, you can change the playbackRate =  number to something other than 3.  You can try .25 or .5 increments, too!\nAlternatives\nIf you like this idea, but you’d like a little more flexibility, you can use this code to ask for a prompt:\njavascript:(function(){document.getElementsByTagName(&quot;video&quot;)[0].playbackRate = prompt(&quot;Please enter the speed you wish to watch the video&quot;, &quot;1&quot;)})();\n\nOther Notes\nThe YouTube video GUI will not update with the new speed, but as soon as you adjust it to a different value, it will return to normal functionality."},"tutorials/2021-02-20-concourseresourcetype":{"slug":"tutorials/2021-02-20-concourseresourcetype","filePath":"tutorials/2021-02-20-concourseresourcetype.md","title":"Creating a Hello World Resource Type for Concourse","links":["tags/resource-types"],"tags":["concourse-concourse-ci-pipelines-cd-ci-resource-type-docker","resource-types"],"content":"What is Concourse?\n\nConcourse is an open-source continuous thing-doer.\n\nConcourse is a CI/CD tool that is configurable with a simple YAML file.\n\nThe Walkthrough\nPre-Requisities\nFollow the steps on concourse-ci.org/ to install Fly &amp; Concourse.\nIf this is your first time checking out Concourse, I would highly recommend reviewing the tutorials &amp; docs they have posted.\nExploring a basic Resource Type\nYou can follow along using or (fork my repo)[github.com/thehandsomezebra/concourse-resourcetype-helloworld].\nA concourse resource_type works well using a minimum of 4 files:\n+-- resource\n|   +-- check\n|   +-- in\n|   +-- out\n+-- Dockerfile\n\nEach of the scripts are required to have the output of its execution in json appropriate format.\nLet’s walk thru each file at a high level and get everything set up!\n\ncheck\nThe check file is going to check for new versions.\nThe check script we will report back a message of Hello World.\n#!/bin/bash\nset -eu\nset -o pipefail\necho &#039;[{ &quot;revision&quot;: &quot;N/A&quot;,  &quot;message&quot;: &quot;The check script says Hello World!&quot; }]&#039;\n\n\nin\nThis fetches the given resource.\nFor the In script, let’s add some metadata.  This metadata will be viewable in a few places in the pipeline.\n#!/bin/bash\nset -eu\nset -o pipefail\necho &#039;{ &quot;version&quot;: { &quot;revision&quot;: &quot;N/A&quot;, &quot;message&quot;: &quot;The in script version message says Hello World&quot; }, &quot;metadata&quot;: [{ &quot;name&quot;: &quot;message&quot;, &quot;value&quot;: &quot;The in script metadata message says Hello World.&quot; }] }&#039;\n\n\n\nout\nFor the Out script, let’s get a little more complex.  We’ll be getting a variable greeting from the pipeline, and let’s echo it out.\nWe’ll be using jq to grab it from the params that get passed via the pipeline.\n#!/bin/bash\necho &#039;{ &quot;version&quot;: { &quot;revision&quot;: &quot;N/A&quot;, &quot;message&quot;: &quot;The out script version message says Hello World&quot; }, &quot;metadata&quot;: [{ &quot;name&quot;: &quot;message&quot;, &quot;value&quot;: &quot;The out script metadata message says Hello World.&quot; }] }&#039;\n\nset -e -u\n\nexec 3&gt;&amp;1 # make stdout available as fd 3 for the result\nexec 1&gt;&amp;2 # redirect all output to stderr for logging\n\necho &quot;Echo says hi from the out script!&quot; &gt;&amp;2\n\nsource=$1\n\nif [[ -z &quot;$source&quot; ]]; then\n  echo &quot;usage: $0 &lt;path/to/source&gt;&quot;\n  exit 1\nfi\n\n# for jq\nPATH=/usr/local/bin:$PATH\n\nexport TMPDIR=${TMPDIR:-/tmp/rclone}\nmkdir -p &quot;${TMPDIR}&quot;\n\npayload=$(mktemp &quot;$TMPDIR/resource-request.XXXXXX&quot;)\ncat &gt; &quot;$payload&quot; &lt;&amp;0\n\ngreeting=$(jq -r &#039;.params.greeting // &quot;&quot;&#039; &lt; &quot;$payload&quot;)\necho &quot;Param greeting says: $greeting&quot; &gt;&amp;2\n\n\nDockerfile\nThis Dockerfile will be short and sweet.\n\nSpins up a tiny Alpine Linux instance\nLoads in bash &amp; jq\nAdds in our script files to the /opt/resource folder\nMakes those files executable\nSpecifies that we will be running bash in root\n\nFROM alpine:3.13\n\nRUN apk add --update --upgrade --no-cache bash\n\nRUN apk update \\\n    &amp;&amp; apk upgrade \\\n    &amp;&amp; apk add --update bash curl unzip jq\n\nADD resource/ /opt/resource/\nRUN chmod +x /opt/resource/*\n\nWORKDIR /\nENTRYPOINT [&quot;/bin/bash&quot;]\n\n\nOne last file to get it running: the pipeline yaml file\nThis file does not need to be in the docker - but it’s inluded in my repo, so you can follow along.\nCreate a file called hello-pipeline.yml\nresource_types:\n- name: helloworld\n  type: docker-image\n  source:\n    # set repo of your helloworld resource\n    #repository: Your-Docker-Acct/Your-Docker-Repository\n    ## or use my helloworld resource\n    repository: thehandsomezebra/concourse-test\n\nresources:\n- name: helloworld\n  type: helloworld\n\njobs:\n- name: hello-job\n  plan:\n  - get: helloworld\n  - put: put-helloworld\n    resource: helloworld\n    inputs:\n         - helloworld\n    params:\n      greeting: &quot;Hey y&#039;all!&quot;\n\nThis is going to create a new pipeline called hello-job that will get the in and put the out.\nGet it running\nFollowing the steps above, create a github repo (or fork mine) &amp; create a docker hub repo. It’s fast to connect your github repo to docker and even set it up to autobuild (learn more about that here)).\nOnce your repo is ready in Docker Hub, let’s start the concourse pipeline by using this line\nLet’s start the hello-world pipeline!\nRun the following in your terminal.\nfly -t ci set-pipeline -c hello-pipeline.yml -p hello-world\n\nci will be the name of your target (if you followed a the tutorial, it might be named tutorial or example)\nIf we look at the pipeline diagram, we can also see the result of the check step in the box with the dashed lines (dependency - trigger).\n\nChecking our job, we can see our messages in each of the stages.\n\nThere’s a lot you can do creating your own resource types for concourse - be sure to check out the Resource Types catalog, contribute to the community and get assistance (or lurk thru questions that have been already answered) in Discord in the resource-types channel.\nNote: I’m not affiliated with Concourse - I am just a nerd that is fascinated by the continuous thing-doer continuously doing things.\n\nSources:\n\nconcourse-ci.org/implementing-resource-types.html\ngithub.com/concourse/resource-types/blob/master/README.md\ngithub.com/concourse/concourse/wiki/Tutorials\n"}}